/* nothing */
"" = "Project-Id-Version: xchat 2.8.4\nReport-Msgid-Bugs-To: www.xchat.org\nPOT-Creation-Date: 2007-06-24 13:05+1000\nPO-Revision-Date: 2007-12-13 00:21+0700\nLast-Translator: Seksan Poltree <seksan.poltree@gmail.com>\nLanguage-Team: Thai <translation-team-th@lists.sourceforge.net>\nMIME-Version: 1.0\nContent-Type: text/plain; charset=utf-8\nContent-Transfer-Encoding: 8bit\nX-Poedit-Language: Thai\nX-Poedit-Country: THAILAND\n";

/* nothing */
"Cannot create ~/.xchat2" = "ไม่สามารถสร้าง ~/.xchat2";

/* nothing */
"I'm busy" = "ฉันไม่ว่าง";

/* nothing */
"Leaving" = "กำลังออก";

/* nothing */
"* Running IRC as root is stupid! You should\n  create a User Account and use that to login.\n" = "* เรียกใช้งาน IRC โดยเป็น root เป็นเรื่องไม่ฉลาด! คุณควร\n  สร้างบัญชีผู้ใช้อื่นสำหรับใช้ในเข้าสู่ระบบ.\n";

/* nothing */
"Waiting" = "กำลังรอ";

/* nothing */
"Active" = "ทำงานอยู่";

/* nothing */
"Failed" = "ล้มเหลว";

/* nothing */
"Done" = "เรียบร้อย";

/* nothing */
"Connect" = "เชื่อมต่อ";

/* nothing */
"Aborted" = "ถูกยกเลิกกลางคัน";

/* nothing */
"Cannot access %s\n" = "ไม่สามารถเข้าถึง %s\n";

/* nothing */
"Error" = "ข้อผิดพลาด";

/* nothing */
"%s is offering \"%s\". Do you want to accept?" = "%s ได้เสนอ \"%s\". คุณต้องการยอมรับหรือไม่?";

/* nothing */
"No active DCCs\n" = "ไม่มี DCCs ที่ทำงานอยู่\n";

/* nothing */
"YES  " = "ใช่";

/* nothing */
"NO   " = "ไม่";

/* nothing */
"You are being CTCP flooded from %s, ignoring %s\n" = "คุณกำลังถูก CTCP flooded จาก %s, ทำการเพิกเฉย %s\n";

/* nothing */
"You are being MSG flooded from %s, setting gui_auto_open_dialog OFF.\n" = "คุณกำลังถูก MSG flooded จาก %s, ทำการตั้งค่า gui_auto_open_dialog OFF.\n";

/* nothing */
"  %-20s online\n" = "  %-20s ออนไลน์\n";

/* nothing */
"  %-20s offline\n" = "  %-20s ออฟไลน์\n";

/* nothing */
"No channel joined. Try /join #<channel>\n" = "ไม่มีแชนแนลที่ทำการเข้าร่วม. ลอง /join #<แชนแนล>\n";

/* nothing */
"Not connected. Try /server <host> [<port>]\n" = "ไม่ได้เชื่อมต่อ. ลอง /server <โฮสต์> [<พอร์ต>]\n";

/* nothing */
"Already marked away: %s\n" = "ทำเครื่องหมายว่าไม่อยู่แล้ว: %s\n";

/* nothing */
"Already marked back.\n" = "ทำเครื่องหมายว่ากลับมาแล้ว.\n";

/* nothing */
"I need /bin/sh to run!\n" = "ฉันจำเป็นต้องมี /bin/sh เพื่อทำงาน!\n";

/* nothing */
"Commands Available:" = "คำสั่งที่มี:";

/* nothing */
"User defined commands:" = "คำสั่งที่ผู้ใช้นิยามขึ้น:";

/* nothing */
"Plugin defined commands:" = "คำสั่งที่ปลั๊กอินนิยามขึ้น:";

/* nothing */
"Type /HELP <command> for more information, or /HELP -l" = "พิมพ์ /HELP <คำสั่ง> สำหรับรายละเอียดที่มากขึ้น, หรือ /HELP -l";

/* nothing */
"Unknown arg '%s' ignored." = "อาร์กิวเมนต์ที่ไม่รู้จัก '%s' ถูกเพิกเฉย.";

/* nothing */
"No such plugin found.\n" = "ไม่พบปลั๊กอินใดๆ\n";

/* nothing */
"That plugin is refusing to unload.\n" = "ปลั๊กอินนั้นกำลังปฎิเสธการโหลดออก.\n";

/* nothing */
"ADDBUTTON <name> <action>, adds a button under the user-list" = "ADDBUTTON <ชื่อ> <ปฏิบัติการ>, เพิ่มปุ่มภายใต้รายชื่อผู้ใช้งาน";

/* nothing */
"ALLCHAN <cmd>, sends a command to all channels you're in" = "ALLCHAN <คำสั่ง>, ส่งคำสั่งไปยังทุกแชนแนลที่คุณเข้าอยู่";

/* nothing */
"ALLCHANL <cmd>, sends a command to all channels you're in" = "ALLCHANL <คำสั่ง>, ส่งคำสั่งไปยังทุกแชนแนลที่คุณเข้าอยู่";

/* nothing */
"ALLSERV <cmd>, sends a command to all servers you're in" = "ALLSERV <คำสั่ง>, ส่งคำสั่งไปยังทุกเซิร์ฟเวอร์ที่คุณเข้าอยู่";

/* nothing */
"AWAY [<reason>], sets you away" = "AWAY [<เหตุผล>], ตั้งค่าให้คุณไม่อยู่";

/* nothing */
"BACK, sets you back (not away)" = "BACK, ตั้งค่าให้คุณกลับมา (ไม่ใช่ไม่อยู่)";

/* nothing */
"BAN <mask> [<bantype>], bans everyone matching the mask from the current channel. If they are already on the channel this doesn't kick them (needs chanop)" = "BAN <มาสก์> [<รูปแบบการแบน>], ประกาศสั่งห้ามทุก ๆ คนที่ตรงกับมาสก์จากแชนแนลปัจจุบัน. ถ้าพวกเขาอยู่ที่แชนแนลนี้แล้ว นี่จะไม่ได้เตะพวกเขาออกไป (จำเป็นต้องมี chanop)";

/* nothing */
"Set per channel options\nCHANOPT CONFMODE ON|OFF - Toggle conf mode/showing of join and part messages\nCHANOPT COLORPASTE ON|OFF - Toggle color paste\nCHANOPT BEEP ON|OFF - Toggle beep on message\nCHANOPT TRAY ON|OFF - Toggle tray blink on message" = "ตั้งค่าตัวเลือกในแต่ละแชนแนล\nCHANOPT CONFMODE ON|OFF - สวิตช์ตัวเลือกโหมดปรับแต่ง/แสดงการเข้าร่วมและส่วนของข้อความ\nCHANOPT COLORPASTE ON|OFF - สวิตช์ตัวเลือกเพลตสี\nCHANOPT BEEP ON|OFF - สวิตช์ตัวเลือกเสียงบี๊บเมื่อมีข้อความ\nCHANOPT TRAY ON|OFF - สวิตช์ตัวเลือกการกระพริบของถาดเมื่อมีข้อความ";

/* nothing */
"CLEAR [ALL|HISTORY], Clears the current text window or command history" = "CLEAR [ALL|HISTORY], ล้างหน้าต่างข้อความ หรือประวัติคำสั่งปัจจุบัน ";

/* nothing */
"CLOSE, Closes the current window/tab" = "CLOSE, ปิดหน้าต่าง/แท็บปัจจุบัน";

/* nothing */
"COUNTRY [-s] <code|wildcard>, finds a country code, eg: au = australia" = "COUNTRY [-s] <รหัส|ไวลด์การ์ด>, ค้นหารหัสประเทศ, เช่น: au = ออสเตรเลีย";

/* nothing */
"CTCP <nick> <message>, send the CTCP message to nick, common messages are VERSION and USERINFO" = "CTCP <ชื่อเล่น> <ข้อความ>, ส่งข้อความ CTCP ไปยัง 'ชื่อเล่น', ข้อความโดยปกติได้แก่ VERSION และ USERINFO";

/* nothing */
"CYCLE [<channel>], parts the current or given channel and immediately rejoins" = "CYCLE [<channel>], แยกแชนแนลปัจจุบันหรือที่เสนอให้ และกลับเข้าร่วมในทันที";

/* nothing */
"\nDCC GET <nick>                      - accept an offered file\nDCC SEND [-maxcps=#] <nick> [file]  - send a file to someone\nDCC PSEND [-maxcps=#] <nick> [file] - send a file using passive mode\nDCC LIST                            - show DCC list\nDCC CHAT <nick>                     - offer DCC CHAT to someone\nDCC PCHAT <nick>                    - offer DCC CHAT using passive mode\nDCC CLOSE <type> <nick> <file>         example:\n         /dcc close send johnsmith file.tar.gz" = "\nDCC GET <ชื่อเล่น>                      - ยอมรับไฟล์ที่ได้รับการเสนอให้\nDCC SEND [-maxcps=#] <ชื่อเล่น> [ไฟล์]  - ส่งไฟล์ไปหาใครซักคน\nDCC PSEND [-maxcps=#] <ชื่อเล่น> [ไฟล์] - ส่งไฟล์ซักไฟล์โดยใช้โหมด passive\nDCC LIST                            - show DCC list\nDCC CHAT <ชื่อเล่น>                     - เสนอ DCC CHAT ให้กับใครซักคน\nDCC PCHAT <ชื่อเล่น>                    - เสนอ DCC CHAT โดยใช้โหมด passive\nDCC CLOSE <รูปแบบ> <ชื่อเล่น> <ไฟล์>         ตัวอย่าง:\n         /dcc close send johnsmith file.tar.gz";

/* nothing */
"DEHOP <nick>, removes chanhalf-op status from the nick on the current channel (needs chanop)" = "DEHOP <ชื่อเล่น>, ลบสถานะ chanhalf-op จาก 'ชื่อเล่น' ในแชนแนลปัจจุบัน (จำเป็นต้องมี chanop)";

/* nothing */
"DELBUTTON <name>, deletes a button from under the user-list" = "DELBUTTON <ชื่อ>, ลบปุ่มภายใต้รายชื่อผู้ใช้";

/* nothing */
"DEOP <nick>, removes chanop status from the nick on the current channel (needs chanop)" = "DEOP <ชื่อเล่น>, ลบสถานะ chanop จาก 'ชื่อเล่น' ในแชนแนลปัจจุบัน (จำเป็นต้องมี chanop)";

/* nothing */
"DEVOICE <nick>, removes voice status from the nick on the current channel (needs chanop)" = "DEVOICE <nick>, สบสถานะประกาศจาก 'ชื่อเล่น' ในแชนแนลปัจจุบัน (จำเป็นต้องมี chanop)";

/* nothing */
"DISCON, Disconnects from server" = "DISCON, ตัดการเชื่อมต่อจากเซิร์ฟเวอร์";

/* nothing */
"DNS <nick|host|ip>, Finds a users IP number" = "DNS <ชื่อเล่น|โฮสต์|ไอพี>, ค้นหาหมายเลขไอพีของผู้ใช้งาน";

/* nothing */
"ECHO <text>, Prints text locally" = "ECHO <ข้อความ>, พิมพ์ข้อความแบบโลคอล";

/* nothing */
"EXEC [-o] <command>, runs the command. If -o flag is used then output is sent to current channel, else is printed to current text box" = "EXEC [-o] <คำสั่ง>, เรียกใช้คำสั่ง. ถ้าใช้เครื่องหมาย -o แล้วผลที่ได้จะถูกส่งไปยังแชนแนลปัจจุบัน, ไม่ก็จะถูกพิมพ์ไปยังกล่องข้อความปัจจุบัน";

/* nothing */
"EXECCONT, sends the process SIGCONT" = "EXECCONT, ส่ง SIGCONT ไปยังโพรเซส";

/* nothing */
"EXECKILL [-9], kills a running exec in the current session. If -9 is given the process is SIGKILL'ed" = "EXECKILL [-9], ฆ่า exec ที่กำลังทำงานในวาระปัจจุบัน. ถ้าใช้เครื่องหมาย -9 โพรเซสจะถูก SIGKILL";

/* nothing */
"EXECSTOP, sends the process SIGSTOP" = "EXECSTOP, ส่ง SIGSTOP ไปยังโพรเซส";

/* nothing */
"EXECWRITE, sends data to the processes stdin" = "EXECWRITE, ส่งข้อมูลไปยังทางป้อนข้อมูลมาตรฐานของโพรเซส";

/* nothing */
"FLUSHQ, flushes the current server's send queue" = "FLUSHQ, ล้างคิวการส่งปัจจุบันของเซิร์ฟเวอร์";

/* nothing */
"GATE <host> [<port>], proxies through a host, port defaults to 23" = "GATE <โฮสต์> [<พอร์ต>], พร็อกซี่ไปยังโฮต์, ค่าพอร์ตมาตรฐานเป็น 23";

/* nothing */
"GHOST <nick> <password>, Kills a ghosted nickname" = "GHOST <ชื่อเล่น> <รหัสผ่าน>, kill 'ชื่อเล่น' ที่ถูกโกสต์";

/* nothing */
"HOP <nick>, gives chanhalf-op status to the nick (needs chanop)" = "HOP <ชื่อเล่น>, ให้สถานะ chanhalf-op กับ 'ชื่อเล่น' (จำเป็นต้องมี chanop)";

/* nothing */
"ID <password>, identifies yourself to nickserv" = "ID <รหัสผ่าน>, ระบุตัวตนของคุณเองไปยังเซิร์ฟเวอร์ชื่อเล่น";

/* nothing */
"IGNORE <mask> <types..> <options..>\n    mask - host mask to ignore, eg: *!*@*.aol.com\n    types - types of data to ignore, one or all of:\n            PRIV, CHAN, NOTI, CTCP, DCC, INVI, ALL\n    options - NOSAVE, QUIET" = "IGNORE <มาสก์> <รูปแบบ..> <ตัวเลือก..>\n    มาสก์ - มาสก์ของโฮสต์ที่จะเพิกเฉย, เช่น: *!*@*.aol.com\n    รูปแบบ - ชนิดรูปแบบของข้อมูลที่จะเพิกเฉย, อย่างหนึ่งหรือทั้งหมดของ:\n            PRIV, CHAN, NOTI, CTCP, DCC, INVI, ALL\n    options - NOSAVE, QUIET";

/* nothing */
"INVITE <nick> [<channel>], invites someone to a channel, by default the current channel (needs chanop)" = "INVITE <ชื่อเล่น> [<แชนแนล>], เชิญชวนใครซักคนเข้าสู่แชนแนลหนึ่ง ๆ, โดยปกติคือแชนแนลปัจจุบัน (จำเป็นต้องมี chanop)";

/* nothing */
"JOIN <channel>, joins the channel" = "JOIN <แชนแนล>, เข้าร่วม 'แชนแนล'";

/* nothing */
"KICK <nick>, kicks the nick from the current channel (needs chanop)" = "KICK <ชื่อเล่น>, เตะ 'ชื่อเล่น' ออกจากแชนแนลปัจจุบัน (จำเป็นต้องมี chanop)";

/* nothing */
"KICKBAN <nick>, bans then kicks the nick from the current channel (needs chanop)" = "KICKBAN <ชื่อเล่น>, แบนและเตะ 'ชื่อเล่น' ออกจากแชนแนลปัจจุบัน (จำเป็นต้องมี chanop)";

/* nothing */
"LAGCHECK, forces a new lag check" = "LAGCHECK, บังคับการตรวจสอบอย่างช้าใหม่";

/* nothing */
"LASTLOG <string>, searches for a string in the buffer" = "LASTLOG <สตริง>, ค้นหา 'สตริง' ที่อยู่ในบัฟเฟอร์";

/* nothing */
"LOAD [-e] <file>, loads a plugin or script" = "LOAD [-e] <ไฟล์>, โหลดปลั๊กอินหรือสคริป";

/* nothing */
"MDEHOP, Mass deop's all chanhalf-ops in the current channel (needs chanop)" = "MDEHOP, Mass deop ของ chanhalf-ops ทั้งหมดในแชนแนลปัจจุบัน (จำเป็นต้องมี chanop)";

/* nothing */
"MDEOP, Mass deop's all chanops in the current channel (needs chanop)" = "MDEOP, Mass deop ของ chanops ทั้งหมดในแชนแนลปัจจุบัน (จำเป็นต้องมี chanop)";

/* nothing */
"ME <action>, sends the action to the current channel (actions are written in the 3rd person, like /me jumps)" = "ME <ปฏิบัติการ>, ส่งการปฏิบัติการไปยังแชนแนลปัจจุบัน (การปฏิบิการถูกเขียนขึ้นโดยบุคคลที่ 3, อย่างเช่น /me jumps)";

/* nothing */
"MKICK, Mass kicks everyone except you in the current channel (needs chanop)" = "MKICK, เตะทุกคนออกจากแชนแนลปัจจุบันยกเว้นคุณ (จำเป็นต้องมี chanop)";

/* nothing */
"MOP, Mass op's all users in the current channel (needs chanop)" = "MOP, Mass op ของผู้ใช้ทั้งหมดในแชนแนลปัจจุบัน (จำเป็นต้องมี chanop)";

/* nothing */
"MSG <nick> <message>, sends a private message" = "MSG <ชื่อเล่น> <ข้อความ>, ส่งข้อความส่วนตัว";

/* nothing */
"NAMES, Lists the nicks on the current channel" = "NAMES, แสดงรายชื่อชื่อเล่นบนแชนแนลปัจจุบัน";

/* nothing */
"NCTCP <nick> <message>, Sends a CTCP notice" = "NCTCP <ชื่อเล่น> <ข้อความ>, ส่งประกาศ CTCP";

/* nothing */
"NEWSERVER [-noconnect] <hostname> [<port>]" = "NEWSERVER [-noconnect] <ชื่อโฮต์> [<พอร์ต>]";

/* nothing */
"NICK <nickname>, sets your nick" = "NICK <ชื่อเล่น>, ตั้งชื่อเล่นของคุณ";

/* nothing */
"NOTICE <nick/channel> <message>, sends a notice. Notices are a type of message that should be auto reacted to" = "OTICE <nick/channel> <message>, ส่งประกาศ. ประกาศเป็นชนิดของข้อความที่ควรจะตอบสนองกลับอัตโนมัติ";

/* nothing */
"NOTIFY [-n network1[,network2,...]] [<nick>], displays your notify list or adds someone to it" = "NOTIFY [-n เครือข่าย1[,เครือข่าย2,...]] [<ชื่อเล่น>], แสดงรายการแจ้งเตือนของคุณหรือเพิ่มบางคนไปยังรายการ";

/* nothing */
"OP <nick>, gives chanop status to the nick (needs chanop)" = "OP <ชื่อเล่น>, ให้สถานะ chanop กับ 'ชื่อเล่น' (จำเป็นต้องมี chanop)";

/* nothing */
"PART [<channel>] [<reason>], leaves the channel, by default the current one" = "PART [<แชนแนล>] [<เหตุผล>], ออกจากแชนแนล, โดยปกติคือหนึ่งแชนแนลปัจจุบัน";

/* nothing */
"PING <nick | channel>, CTCP pings nick or channel" = "PING <nick | channel>, ส่ง CTCP เพื่อ ping ชื่อเล่นหรือแชนแนล";

/* nothing */
"QUERY [-nofocus] <nick>, opens up a new privmsg window to someone" = "QUERY [-nofocus] <ชื่อเล่น>, เปิดหน้าต่างข้อความส่วนตัวกับใครบางคน";

/* nothing */
"QUIT [<reason>], disconnects from the current server" = "QUIT [<เหตุผล>], ตัดการเชื่อมต่อจากเซิร์ฟเวอร์ปัจจุบัน";

/* nothing */
"QUOTE <text>, sends the text in raw form to the server" = "QUOTE <ข้อความ>, ส่งข้อความในรูปแบบข้อมูลดิบไปยังเซิร์ฟเวอร์";

/* nothing */
"RECONNECT [-ssl] [<host>] [<port>] [<password>], Can be called just as /RECONNECT to reconnect to the current server or with /RECONNECT ALL to reconnect to all the open servers" = "RECONNECT [-ssl] [<โฮสต์>] [<พอร์ต>] [<รหัสผ่าน>], สามารถเรียกเพียง /RECONNECT เพื่อที่จะทำการเชื่อมต่ออีกครั้งกับเซิร์ฟเวอร์ปัจจุบัน หรือด้วย /RECONNECT ALL สำหรับทำการเชื่อมต่ออีกครั้งกับเซิร์ฟเวอร์ทั้งหมดที่เปิดอยู่";

/* nothing */
"RECONNECT [<host>] [<port>] [<password>], Can be called just as /RECONNECT to reconnect to the current server or with /RECONNECT ALL to reconnect to all the open servers" = "RECONNECT [<โฮสต์>] [<พอร์ต>] [<รหัสผ่าน>], สามารถถูกเรียกเพียง /RECONNECT เพื่อที่จะทำการเชื่อมต่ออีกครั้งกับเซิร์ฟเวอร์ปัจจุบัน หรือด้วย /RECONNECT ALL สำหรับทำการเชื่อมต่ออีกครั้งกับเซิร์ฟเวอร์ทั้งหมดที่เปิดอยู่";

/* nothing */
"RECV <text>, send raw data to xchat, as if it was received from the irc server" = "RECV <ข้อความ>, ส่งข้อมูลดิบไปยัง xchat, ตามที่ได้หากรับมาจากเซิร์ฟเวอร์ irc";

/* nothing */
"SAY <text>, sends the text to the object in the current window" = "SAY <ข้อความ>, ส่งข้อความไปยังวัตถุในหน้าต่างปัจจุบัน";

/* nothing */
"SEND <nick> [<file>]" = "SEND <ชื่อเล่น> [<ไฟล์>]";

/* nothing */
"SERVCHAN [-ssl] <host> <port> <channel>, connects and joins a channel" = "SERVCHAN [-ssl] <โฮสต์> <พอร์ต> <แชนแนล>, เชื่อมต่อและเข้าร่วมแชนแนล";

/* nothing */
"SERVCHAN <host> <port> <channel>, connects and joins a channel" = "SERVCHAN <โฮสต์> <พอร์ต> <แชนแนล>, เชื่อมต่อและเข้าร่วมแชนแนล";

/* nothing */
"SERVER [-ssl] <host> [<port>] [<password>], connects to a server, the default port is 6667 for normal connections, and 9999 for ssl connections" = "SERVER [-ssl] <เครื่องแม่ข่าย> [<พอร์ต>] [<รหัสผ่าน>], เชื่อมต่อไปยังเซิร์ฟเวอร์. โดยพอร์ตมาตรฐานสำหรับการเชื่อมต่อปกติคือ 6667, และ 9999 สำหรับการเชื่อมต่อโดยใช้ ssl";

/* nothing */
"SERVER <host> [<port>] [<password>], connects to a server, the default port is 6667" = "SERVER <host> [พอร์ต>] [<รหัสผ่าน>], เชื่อมต่อไปยังเซิร์ฟเวอร์, พอร์ตมาตรฐานคือ 6667";

/* nothing */
"SET [-e] [-or] [-quiet] <variable> [<value>]" = "SET [-e] [-or] [-quiet] <ตัวแปร> [<ค่า>]";

/* nothing */
"SETCURSOR [-|+]<position>" = "SETCURSOR [-|+]<ตำแหน่ง>";

/* nothing */
"TOPIC [<topic>], sets the topic if one is given, else shows the current topic" = "TOPIC [<หัวเรื่อง>], ตั้งหัวเรื่องถ้าบางคนได้รับมา, หรือแสดงหัวเรื่องปัจจุบัน";

/* nothing */
"\nTRAY -f <timeout> <file1> [<file2>] Blink tray between two icons.\nTRAY -f <filename>                  Set tray to a fixed icon.\nTRAY -i <number>                    Blink tray with an internal icon.\nTRAY -t <text>                      Set the tray tooltip.\nTRAY -b <title> <text>              Set the tray balloon." = "\nTRAY -f <เวลาหมด> <ไฟล์1> [<ไฟล์2>] กระพริบถามระหว่างสองไอคอน.\nTRAY -f <ชื่อไฟล์>                      ตั้งถามสำหรับไอคอนที่ถูกตรึง.\nTRAY -i <ตัวเลข>                       กระพริบถาดด้วยไอคอนภายใน.\nTRAY -t <ข้อความ>                     ตั้งค่าข้อความช่วยเหลือของถาด.\nTRAY -b <ชื่อเรื่อง> <ข้อความ>              ตั้งค่าบอลลูนของถาด.";

/* nothing */
"UNBAN <mask> [<mask>...], unbans the specified masks." = "UNBAN <mask> [<mask>...], ยกเลิกแบนสำหรับมาสก์ที่กำหนด.";

/* nothing */
"UNIGNORE <mask> [QUIET]" = "UNIGNORE <มาสก์> [QUIET]";

/* nothing */
"UNLOAD <name>, unloads a plugin or script" = "UNLOAD <ชื่อ>, โหลดปลั๊กอินหรือสคริปออกไป";

/* nothing */
"URL <url>, opens a URL in your browser" = "URL <url>, เปิด URL ในบราวเซอร์ของคุณ";

/* nothing */
"USELECT [-a] [-s] <nick1> <nick2> etc, highlights nick(s) in channel userlist" = "USELECT [-a] [-s] <ชื่อเล่น1> <ชื่อเล่น2> etc, เน้นชื่อเล่น(s) ในรายชื่อผู้ใช้ของแชนแนล";

/* nothing */
"VOICE <nick>, gives voice status to someone (needs chanop)" = "VOICE <ชื่อเล่น>, ให้สถานะประกาศกับใครบางคน (จำเป็นต้องมี chanop)";

/* nothing */
"WALLCHAN <message>, writes the message to all channels" = "WALLCHAN <ข้อความ>, เขียนข้อความไปยังแชนแนลทั้งหมด";

/* nothing */
"WALLCHOP <message>, sends the message to all chanops on the current channel" = "WALLCHOP <ข้อความ>, ส่งข้อความไปยัง chanops ทั้งหมดในแชนแนลปัจจุบัน";

/* nothing */
"Usage: %s\n" = "วิธีใช้: %s\n";

/* nothing */
"\nNo help available on that command.\n" = "\nไม่มีข้อความช่วยเหลือสำหรับคำสั่งนั้น.\n";

/* nothing */
"No such command.\n" = "ไม่ใช่คำสั่ง.\n";

/* nothing */
"Bad arguments for user command.\n" = "อาร์กิวเมนต์ไม่ถูกต้องสำหรับคำสั่งผู้ใช้งาน.\n";

/* nothing */
"Too many recursive usercommands, aborting." = "คำสั่งเรียกตัวเองซ้ำซ้อนมากเกินไป, ทำการยกเลิกกลางคัน.";

/* nothing */
"Unknown Command. Try /help\n" = "คำสั่งที่ไม่รู้จัก. ลอง /help\n";

/* nothing */
"No xchat_plugin_init symbol; is this really an xchat plugin?" = "ไม่พบเครื่องหมาย xchat_plugin_init; นี่เป็นปลั๊กอินของ xchat จริง ๆ หรือไม่?";

/* nothing */
"Are you sure this is a SSL capable server and port?\n" = "คุณแน่ใจหรือว่านี่เป็นเซิร์ฟเวอร์และพอร์ต ที่สนับสนุนการทำงานของ SSL?\n";

/* nothing */
"Cannot resolve hostname %s\nCheck your IP Settings!\n" = "ไม่สามารถวิเคราะชื่อของโฮสต์ %s\nตรวจสอบการตั้งค่าไอพีของคุณ!\n";

/* nothing */
"Proxy traversal failed.\n" = "Proxy traversal ล้มเหลว.\n";

/* nothing */
"Cycling to next server in %s...\n" = "วนไปยังเซิร์ฟเวอร์ถัดไปใน %s...\n";

/* nothing */
"Warning: \"%s\" character set is unknown. No conversion will be applied for network %s." = "คำเตือน: ไม่รู้จักชุดอักขระ \"%s\". ไม่มีการสนทนาที่จะถูกนำมาใช้กับเครือข่าย %s.";

/* nothing */
"%C22*%O$t$1 added to notify list." = "%C22*%O$t$1 ถูกเพิ่มไปยังรายการแจ้งเตือน.";

/* nothing */
"%C22*%O$t$1 Banlist:%C19 $4%C20 $2%C21 $3" = "%C22*%O$t$1 รายชื่อแบน:%C19 $4%C20 $2%C21 $3";

/* nothing */
"%C22*%O$tCannot join%C26 %B$1 %O(You are banned)." = "%C22*%O$tไม่สามารถเข้าร่วม%C26 %B$1 %O(คุณถูกแบนไว้).";

/* nothing */
"%C22*%O$t$1 is now known as $2" = "%C22*%O$t$1 ขณะนี้ได้ถูกรู้จักเป็น $2";

/* nothing */
"%C22*%O$t$1 sets ban on $2" = "%C22*%O$t$1 ตั้งค่าการแบนบน $2";

/* nothing */
"%C22*%O$tChannel $1 created on $2" = "%C22*%O$tแชนแนล $1 สร้างเมื่อ $2";

/* nothing */
"%C22*%O$t%C26$1%O removes channel half-operator status from%C26 $2" = "%C22*%O$t%C26$1%O ลบสถานะ half-operator ของแชนแนล จาก%C26 $2";

/* nothing */
"%C22*%O$t%C26$1%O removes channel operator status from%C26 $2" = "%C22*%O$t%C26$1%O ลบสถานะผู้ควบคุมแชนแนลจาก%C26 $2";

/* nothing */
"%C22*%O$t%C26$1%O removes voice from%C26 $2" = "%C22*%O$t%C26$1%O ลบการประกาศจาก%C26 $2";

/* nothing */
"%C22*%O$t$1 sets exempt on $2" = "%C22*%O$t$1 ตั้งค่า exempt บน $2";

/* nothing */
"%C22*%O$t%C26$1%O gives channel half-operator status to%C26 $2" = "%C22*%O$t%C26$1%O ให้สถานะ half-operator กับ%C26 $2";

/* nothing */
"%C22*%O$t$1 sets invite on $2" = "%C22*%O$t$1 ตั้งค่าเชิญชวนบน $2";

/* nothing */
"%UChannel          Users   Topic" = "%Uแชนแนล          ผู้ใช้   หัวข้อ";

/* nothing */
"%C22*%O$t$1 sets mode $2$3 $4" = "%C22*%O$t$1 ตั้งค่าโหมด $2$3 $4";

/* nothing */
"%C22*%O$t%C22Channel $1 modes: $2" = "%C22*%O$t%C22แชนแนล $1 โหมด: $2";

/* nothing */
"%C22*%O$t%C26$1%O gives channel operator status to%C26 $2" = "%C22*%O$t%C26$1%O ให้สถานะผู้ควบคุมแชนแนลกับ%C26 $2";

/* nothing */
"%C22*%O$t$1 removes exempt on $2" = "%C22*%O$t$1 ลบ exempt บน $2";

/* nothing */
"%C22*%O$t$1 removes invite on $2" = "%C22*%O$t$1 ลบการเชิญชวนบน $2";

/* nothing */
"%C22*%O$t$1 removes channel keyword" = "%C22*%O$t$1 ลบคีย์เวิร์ดของแชนแนล";

/* nothing */
"%C22*%O$t$1 removes user limit" = "%C22*%O$t$1 ลบขอบเขตของผู้ใช้";

/* nothing */
"%C22*%O$t$1 sets channel keyword to $2" = "%C22*%O$t$1 ตั้งค่าคีย์เวิร์ดไปเป็น $2";

/* nothing */
"%C22*%O$t$1 sets channel limit to $2" = "%C22*%O$t$1 ตั้งค่าขีดจำกัดของแชนแนลเป็น $2";

/* nothing */
"%C22*%O$t$1 removes ban on $2" = "%C22*%O$t$1 ลบการแบนบน $2";

/* nothing */
"%C22*%O$t%C26$1%O gives voice to%C26 $2" = "%C22*%O$t%C26$1%O ให้การประกาศกับ%C26 $2";

/* nothing */
"%C22*%O$t%C22Connected. Now logging in..." = "%C22*%O$t%C22เชื่อมด่อแล้ว. ขณะนี้กำลังเข้าสู่ระบบ...";

/* nothing */
"%C22*%O$t%C22Connecting to $1 ($2) port $3%O..." = "%C22*%O$t%C22เชื่อมต่อไปยัง $1 ($2) port $3%O...";

/* nothing */
"%C21*%O$t%C21Connection failed. Error: $1" = "%C21*%O$t%C21การเชื่อมต่อล้มเหลว. ข้อผิดพลาด: $1";

/* nothing */
"%C22*%O$tReceived a CTCP $1 from $2" = "%C22*%O$tได้รับ CTCP $1 จาก $2";

/* nothing */
"%C22*%O$tReceived a CTCP $1 from $2 (to $3)" = "%C22*%O$tได้รับ CTCP $1 จาก $2 (ไปยัง $3)";

/* nothing */
"%C19>%O$1%C19<%O$tCTCP $2" = "%C19>%O$1%C19<%O$tCTCP $2";

/* nothing */
"%C22*%O$tReceived a CTCP Sound $1 from $2" = "%C22*%O$tได้รับเสียง CTCP $1 จาก $2";

/* nothing */
"%C22*%O$tReceived a CTCP Sound $1 from $2 (to $3)" = "%C22*%O$tได้รับเสียง CTCP $1 จาก $2 (ไปยัง $3)";

/* nothing */
"%C22*%O$tDCC CHAT to %C26$1%O aborted." = "%C22*%O$tDCC CHAT ไปยัง %C26$1%O ถูกยกเลิกกลางคัน.";

/* nothing */
"%C22*%O$tDCC CHAT connection established to %C26$1 %C30[%O$2%C30]" = "%C22*%O$tDCC CHAT การเชื่อมต่อถูกสร้างไปยัง %C26$1 %C30[%O$2%C30]";

/* nothing */
"%C22*%O$tDCC CHAT to %C26$1%O lost ($4)." = "%C22*%O$tDCC CHAT ไปยัง %C26$1%O เสียหาย ($4).";

/* nothing */
"%C22*%O$tReceived a DCC CHAT offer from $1" = "%C22*%O$tได้รับการเสนอ DCC CHAT จาก $1";

/* nothing */
"%C22*%O$tOffering DCC CHAT to $1" = "%C22*%O$tทำการเสนอ DCC CHAT ไปยัง $1";

/* nothing */
"%C22*%O$tAlready offering CHAT to $1" = "%C22*%O$tได้ทำการเสนอ CHAT ไปยัง $1 แล้ว";

/* nothing */
"%C22*%O$tDCC $1 connect attempt to%C26 $2%O failed (err=$3)." = "%C22*%O$tDCC $1 พยายามเชื่อมต่อไปยัง%C26 $2%O ล้มเหลว (err=$3).";

/* nothing */
"%C22*%O$tReceived '$1%O' from $2" = "%C22*%O$tได้รับ '$1%O' จาก $2";

/* nothing */
"%C24,18 Type  To/From    Status  Size    Pos     File         " = "%C24,18 ชนิด  ไปยัง/จาก    สถานะ  ขนาด    ตำแหน่ง     ไฟล์         ";

/* nothing */
"%C22*%O$tReceived a malformed DCC request from %C26$1%O.%010%C22*%O$tContents of packet: $2" = "%C22*%O$tได้รับการร้องขอ DCC ที่ผิดรูปแบบจาก %C26$1%O.%010%C22*%O$tเนื้อหาของแพ็กเก็ต: $2";

/* nothing */
"%C22*%O$tOffering%C26 $1%O to%C26 $2" = "%C22*%O$tทำการเสนอ%C26 $1%O ไปยัง%C26 $2";

/* nothing */
"%C22*%O$tNo such DCC offer." = "%C22*%O$tไม่มีการเสนอ DCC.";

/* nothing */
"%C22*%O$tDCC RECV%C26 $2%O to%C26 $1%O aborted." = "%C22*%O$tDCC RECV%C26 $2%O ไปยัง%C26 $1%O ถูกยกเลิกกลางคัน.";

/* nothing */
"%C22*%O$tDCC RECV%C26 $1%O from%C26 $3%O complete %C30[%C26$4%O cps%C30]%O." = "%C22*%O$tDCC RECV%C26 $1%O จาก%C26 $3%O เสร็จสิ้น %C30[%C26$4%O cps%C30]%O.";

/* nothing */
"%C22*%O$tDCC RECV connection established to%C26 $1 %C30[%O$2%C30]" = "%C22*%O$tDCC RECV การเชื่อมต่อถูกสร้างขึ้นไปยัง%C26 $1 %C30[%O$2%C30]";

/* nothing */
"%C22*%O$tDCC RECV%C26 $1%O from%C26 $3%O failed ($4)." = "%C22*%O$tDCC RECV%C26 $1%O จาก%C26 $3%O ล้มเหลว ($4).";

/* nothing */
"%C22*%O$tDCC RECV: Cannot open $1 for writing ($2)." = "%C22*%O$tDCC RECV: ไม่สามารถเปิด $1 เพื่อการเขียนได้ ($2).";

/* nothing */
"%C22*%O$tThe file%C26 $1%C already exists, saving it as%C26 $2%O instead." = "%C22*%O$tไฟล์%C26 $1%C ได้มีอยู่ก่อนแล้ว, บันทีกเป็น%C26 $2%O แทน.";

/* nothing */
"%C22*%O$t%C26$1 %Ohas requested to resume%C26 $2 %Cfrom%C26 $3%C." = "%C22*%O$t%C26$1 %Oได้ร้องขอเพื่อที่จะเริ่มใหม่%C26 $2 %Cจาก%C26 $3%C.";

/* nothing */
"%C22*%O$tDCC SEND%C26 $2%O to%C26 $1%O aborted." = "%C22*%O$tDCC SEND%C26 $2%O ไปยัง%C26 $1%O ถูกยกเลิกก่อนสำเร็จ.";

/* nothing */
"%C22*%O$tDCC SEND%C26 $1%O to%C26 $2%O complete %C30[%C26$3%O cps%C30]%O." = "%C22*%O$tDCC SEND%C26 $1%O to%C26 $2%O เสร็จสิ้น %C30[%C26$3%O cps%C30]%O.";

/* nothing */
"%C22*%O$tDCC SEND connection established to%C26 $1 %C30[%O$2%C30]" = "%C22*%O$tDCC SEND การเชื่อมต่อถูกสร้างขึ้นไปยัง%C26 $1 %C30[%O$2%C30]";

/* nothing */
"%C22*%O$tDCC SEND%C26 $1%O to%C26 $2%O failed. $3" = "%C22*%O$tDCC SEND%C26 $1%O ไปยัง%C26 $2%O ล้มเหลว. $3";

/* nothing */
"%C22*%O$t%C26$1 %Ohas offered%C26 $2 %O(%C26$3 %Obytes)" = "%C22*%O$t%C26$1 %Oได้เสนอ%C26 $2 %O(%C26$3 %Obytes)";

/* nothing */
"%C22*%O$tDCC $1%C26 $2 %Oto%C26 $3 %Cstalled - aborting." = "%C22*%O$tDCC $1%C26 $2 %Oไปยัง%C26 $3 %Cถูกหยุดกลางคัน - ทำการยกเลิกกลางคัน.";

/* nothing */
"%C22*%O$tDCC $1%C26 $2 %Oto%C26 $3 %Otimed out - aborting." = "%C22*%O$tDCC $1%C26 $2 %Oไปยัง%C26 $3 %Oหมดเวลา - ทำการยกเลิกกลางคัน.";

/* nothing */
"%C22*%O$t$1 deleted from notify list." = "%C22*%O$t$1 ลบจากรายการแจ้งเตือนแล้ว";

/* nothing */
"%C22*%O$tDisconnected ($1)." = "%C22*%O$tตัดการเชื่อมต่อ ($1).";

/* nothing */
"%C22*%O$tFound your IP: [$1]" = "%C22*%O$tพบไอพีของคุณ: [$1]";

/* nothing */
"%O%C26$1%O added to ignore list." = "%O%C26$1%O ถูกเพิ่มไปยังรายการเพิกเฉย.";

/* nothing */
"Ignore on %C26$1%O changed." = "การเพิกเฉยบน %C26$1%O เปลี่ยนไป.";

/* nothing */
"%C24,18                                                              " = "%C24,18                                                              ";

/* nothing */
"%C24,18 Hostmask                  PRIV NOTI CHAN CTCP DCC  INVI UNIG " = "%C24,18 มาสก์ของโฮสต์                  PRIV NOTI CHAN CTCP DCC  INVI UNIG ";

/* nothing */
"%O%C26$1%O removed from ignore list." = "%O%C26$1%O ลบจากรายการเพิกเฉยแล้ว.";

/* nothing */
"  Ignore list is empty." = "  รายการเพิกเฉยว่างเปล่า.";

/* nothing */
"%C22*%O$tCannot join%C26 %B$1 %O(Channel is invite only)." = "%C22*%O$tไมาสามารถเข้าร่วม%C26 %B$1 %O(แชนแนลนี้ต้องได้รับเชิญเท่านั้น).";

/* nothing */
"%C22*%O$tYou have been invited to%C26 $1%O by%C26 $2%C (%C26$3%C)" = "%C22*%O$tคุณได้ได้รับเชิญไปยัง%C26 $1%O by%C26 $2%C (%C26$3%C)";

/* nothing */
"%C19*%O$t%C19%B$1 %B($3) has joined $2" = "%C19*%O$t%C19%B$1 %B($3) ได้เข้าร่วม $2";

/* nothing */
"%C22*%O$tCannot join%C26 %B$1 %O(Requires keyword)." = "%C22*%O$tไม่สามารถเข้าร่วม%C26 %B$1 %O(ต้องการคีย์เวิร์ด).";

/* nothing */
"%C21*%O$t%C21$1 has kicked $2 from $3 ($4%O%C21)" = "%C21*%O$t%C21$1 ได้เตะ $2 จาก $3 ($4%O%C21)";

/* nothing */
"%C22*%O$tYou have been killed by $1 ($2%O%C22)" = "%C22*%O$tคุณได้ถูก kill โดย $1 ($2%O%C22)";

/* nothing */
"%C22*%O$t%C22MOTD Skipped." = "%C22*%O$t%C22MOTD ถูกข้ามไป.";

/* nothing */
"%C22*%O$t$1 already in use. Retrying with $2..." = "%C22*%O$t$1 ได้ถูกใช้งานอยู่แล้ว. กำลังลองใหม่ด้วย $2...";

/* nothing */
"%C22*%O$tNickname already in use. Use /NICK to try another." = "%C22*%O$tชื่อเล่นได้ถูกใช้งานอยู่แล้ว. ใช้ /NICK เพื่อที่จะลองอย่างอื่น.";

/* nothing */
"%C22*%O$tNo such DCC." = "%C22*%O$tไม่มี DCC.";

/* nothing */
"%C22*%O$tNo process is currently running" = "%C22*%O$tไม่มีโปรเซสที่กำลังทำงานอยู่";

/* nothing */
"$tNotify list is empty." = "$tรายการแจ้งเตือนว่างเปล่า.";

/* nothing */
"%C24,18 %B  Notify List                           " = "%C24,18 %B  รายการแจ้งเตือน                           ";

/* nothing */
"%C22*%O$t$1 users in notify list." = "%C22*%O$t$1 ผู้ใช้ในรายการแจ้งเตือน.";

/* nothing */
"%C22*%O$tNotify: $1 is offline ($3)." = "%C22*%O$tแจ้งเตือน: $1 ออฟไลน์ ($3).";

/* nothing */
"%C22*%O$tNotify: $1 is online ($3)." = "%C22*%O$tแจ้งเตือน: $1 ออนไลน์ ($3).";

/* nothing */
"%C23*%O$t%C23$1 (%O%C23$2) has left $3" = "%C23*%O$t%C23$1 (%O%C23$2) ได้ออกจาก $3";

/* nothing */
"%C23*%O$t%C23$1 (%O%C23$2) has left $3 (%O%C23%B%B$4%O%C23)" = "%C23*%O$t%C23$1 (%O%C23$2) ได้ออกจาก $3 (%O%C23%B%B$4%O%C23)";

/* nothing */
"%C22*%O$tPing reply from $1: $2 second(s)" = "%C22*%O$tการตอบรับการ ping จาก $1: $2 วินาที(s)";

/* nothing */
"%C22*%O$tNo ping reply for $1 seconds, disconnecting." = "%C22*%O$tไม่มีการตอบรับการ ping  เป็นเวลา $1 วินาที, กำลังตัดการเชื่อมต่อ.";

/* nothing */
"%C22*%O$tA process is already running" = "%C22*%O$tโปรเซสหนึ่งได้ทำงานอยู่แล้ว";

/* nothing */
"%C23*%O$t%C23$1 has quit (%O%C23%B%B$2%O%C23)" = "%C23*%O$t%C23$1 ได้ออกจาก (%O%C23%B%B$2%O%C23)";

/* nothing */
"%C22*%O$t$1 sets modes%B %C30[%O$2%B%C30]" = "%C22*%O$t$1 ตั้งค่าโหมด%B %C30[%O$2%B%C30]";

/* nothing */
"%C28-%C29$1/Wallops%C28-%O$t$2" = "%C28-%C29$1/Wallops%C28-%O$t$2";

/* nothing */
"%C22*%O$tLooking up IP number for%C26 $1%O..." = "%C22*%O$tค้นหาหมายเลขไอพีสำหรับ%C26 $1%O...";

/* nothing */
"%C22*%O$t%C22Connected." = "%C22*%O$t%C22เชื่อมต่อแล้ว.";

/* nothing */
"%C22*%O$t%C22Looking up $1" = "%C22*%O$t%C22ค้นหา $1";

/* nothing */
"%C22*%O$tStopped previous connection attempt (pid=$1)" = "%C22*%O$tหยุดการพยายามเชื่อมต่อก่อนหน้า (pid=$1)";

/* nothing */
"%C29*%O$t%C29Topic for $1%C %C29is: $2" = "%C29*%O$t%C29หัวข้อสำหรับ $1%C %C29is: $2";

/* nothing */
"%C22*%O$t$1 has changed the topic to: $2" = "%C22*%O$t$1 ได้เปลี่ยนหัวข้อไปเป็น: $2";

/* nothing */
"%C29*%O$t%C29Topic for $1%C %C29set by $2%C %C29at $3" = "%C29*%O$t%C29หัวข้อสำหรับ $1%C %C29ตั้งโดย $2%C %C29ที่ $3";

/* nothing */
"%C22*%O$tUnknown host. Maybe you misspelled it?" = "%C22*%O$tไม่รู้จักโฮสต์. บางทีคุณอาจสะกดผิดหรือเปล่า?";

/* nothing */
"%C22*%O$tCannot join%C26 %B$1 %O(User limit reached)." = "%C22*%O$tไม่สามาระเข้าร่วม%C26 %B$1 %O(ถึงขีดจำกัดจำนวนผู้ใช้).";

/* nothing */
"%C22*%O$t%C26Users on $1:%C $2" = "%C22*%O$t%C26ผู้ใช้ บน $1:%C $2";

/* nothing */
"%C22*%O$t%C28[%O$1%C28] %O$2%C27 $3" = "%C22*%O$t%C28[%O$1%C28] %O$2%C27 $3";

/* nothing */
"%C22*%O$t%C28[%O$1%C28] %Cis away %C30(%O$2%O%C30)" = "%C22*%O$t%C28[%O$1%C28] %Cไม่อยู่ %C30(%O$2%O%C30)";

/* nothing */
"%C22*%O$t%C28[%O$1%C28]%O $2" = "%C22*%O$t%C28[%O$1%C28]%O $2";

/* nothing */
"%C22*%O$t%C28[%O$1%C28] %OEnd of WHOIS list." = "%C22*%O$t%C28[%O$1%C28] %Oสิ้นสุดของรายการ WHOIS.";

/* nothing */
"%C22*%O$t%C28[%O$1%C28]%O idle%C26 $2" = "%C22*%O$t%C28[%O$1%C28]%O ว่างอยู่%C26 $2";

/* nothing */
"%C22*%O$t%C28[%O$1%C28]%O idle%C26 $2%O, signon:%C26 $3" = "%C22*%O$t%C28[%O$1%C28]%O ว่างอยู่%C26 $2%O, เข้าระบบ:%C26 $3";

/* nothing */
"%C22*%O$t%C28[%O$1%C28] %C30(%O$2@$3%C30)%O: $4" = "%C22*%O$t%C28[%O$1%C28] %C30(%O$2@$3%C30)%O: $4";

/* nothing */
"%C22*%O$t%C28[%O$1%C28] %Oreal user@host%C27 $2%O, real IP%C27 $3" = "%C22*%O$t%C28[%O$1%C28] %Oผู้ใช้จริง@โฮสต์%C27 $2%O, ไอพีจริง%C27 $3";

/* nothing */
"%C19*%O$t%C19Now talking on $2" = "%C19*%O$t%C19กำลังพูดคุยบน $2";

/* nothing */
"%C23*$tYou have been kicked from $2 by $3 ($4%O%C23)" = "%C23*$tคุณได้ถูกเตะออกจาก $2 โดย $3 ($4%O%C23)";

/* nothing */
"%C23*$tYou have left channel $3" = "%C23*$tคุณได้ออกจากแชนแนล $3";

/* nothing */
"%C23*$tYou have left channel $3 (%O%C23%B%B$4%O%C23)" = "%C23*$tคุณได้ออกจากแชนแนล $3 (%O%C23%B%B$4%O%C23)";

/* nothing */
"%C22*%O$tYou've invited%C26 $1%O to%C26 $2%O (%C26$3%O)" = "%C22*%O$tคุณได้เชิญชวน%C26 $1%O ไปยัง%C26 $2%O (%C26$3%O)";

/* nothing */
"%C22*%O$tYou are now known as $2" = "%C22*%O$tตอนนี้คุณได้รับการรู้จักเป็น $2";

/* nothing */
"Loaded log from" = "โหลดบันทึกการทำงานจาก";

/* nothing */
"**** ENDING LOGGING AT %s\n" = "**** จบการบันทึกการทำงานที่ %s\n";

/* nothing */
"**** BEGIN LOGGING AT %s\n" = "**** เริ่มบันทึกการทำงานที่ %s\n";

/* nothing */
"* Can't open log file(s) for writing. Check the\n  permissions on %s/xchatlogs" = "* ไม่สามารถเปิดบันทึกการทำงาน(s) เพื่อการเขียน. ตรวจสอบ\n  ตรวจสอบสิทธิการเข้าถึงบน %s/xchatlogs";

/* nothing */
"Left message" = "ข้อความทางซ้าย";

/* nothing */
"Right message" = "ข้อความทางขวา";

/* nothing */
"The nick of the joining person" = "ชื่อเล่นของคนที่เข้าร่วม";

/* nothing */
"The channel being joined" = "แชนแนลที่ถูกเข้าร่วม";

/* nothing */
"The host of the person" = "โฮสต์ของบุคคล";

/* nothing */
"Nickname" = "ชื่อเล่น";

/* nothing */
"The action" = "การปฏิบัติการ";

/* nothing */
"Mode char" = "ตัวหนังสือโหมด";

/* nothing */
"The text" = "ข้อความ";

/* nothing */
"Identified text" = "ข้อความแสดงตัว";

/* nothing */
"The message" = "ข้อความ";

/* nothing */
"Old nickname" = "ชื่อเล่นเดิม";

/* nothing */
"New nickname" = "ชื่อเล่นใหม่";

/* nothing */
"Nick of person who changed the topic" = "ชื่อเล่นของคนที่เปลี่ยนหัวข้อ";

/* nothing */
"Topic" = "หัวข้อ";

/* nothing */
"Channel" = "แชนแนล";

/* nothing */
"The nickname of the kicker" = "ชื่อของคนที่เตะ";

/* nothing */
"The person being kicked" = "คนที่กำลังถูกเตะ";

/* nothing */
"The channel" = "แชนแนล";

/* nothing */
"The reason" = "เหตุผล";

/* nothing */
"The nick of the person leaving" = "ชื่อเล่นของคนที่กำลังจากไป";

/* nothing */
"The time" = "เวลา";

/* nothing */
"The creator" = "ผู้สร้าง";

/* nothing */
"Nick" = "ชื่อเล่น";

/* nothing */
"Reason" = "เหตุผล";

/* nothing */
"Host" = "โฮสต์";

/* nothing */
"Who it's from" = "ใครที่มันมาจาก";

/* nothing */
"The time in x.x format (see below)" = "เวลาในรูปแบบ x.x  (ดูด้านล่าง)";

/* nothing */
"The Channel it's going to" = "แชนแนลที่มันกำลังไป";

/* nothing */
"The sound" = "เสียง";

/* nothing */
"The nick of the person" = "ชื่อเล่นของบุคคล";

/* nothing */
"The CTCP event" = "เหตุการณ์ CTCP";

/* nothing */
"The nick of the person who set the key" = "ชื่อเล่นของคนที่ตั้งค่ากุญแจ";

/* nothing */
"The key" = "กุญแจ";

/* nothing */
"The nick of the person who set the limit" = "ชื่อเล่นของคนที่ตั้งค่าขีดจำกัด";

/* nothing */
"The limit" = "ขีดจำกัด";

/* nothing */
"The nick of the person who did the op'ing" = "ชื่อเล่นของคนที่ทำการ op'ing";

/* nothing */
"The nick of the person who has been op'ed" = "ชื่อเล่นของคนที่ได้ถูก op";

/* nothing */
"The nick of the person who has been halfop'ed" = "ชื่อเล่นของคนที่ได้ถูก halfop";

/* nothing */
"The nick of the person who did the halfop'ing" = "ชื่อเล่นของคนที่ทำการ halfop";

/* nothing */
"The nick of the person who did the voice'ing" = "ชื่อเล่นของคนที่ทำการประกาศ";

/* nothing */
"The nick of the person who has been voice'ed" = "ชื่อเล่นของคนที่ได้ถูกประกาศ";

/* nothing */
"The nick of the person who did the banning" = "ชื่อเล่นของคนที่ทำการแบน";

/* nothing */
"The ban mask" = "มาสก์การแบน";

/* nothing */
"The nick who removed the key" = "ชื่อเล่นของคนที่ลบกุญแจ";

/* nothing */
"The nick who removed the limit" = "ชื่อเล่นของคนที่ลบขีดจำกัด";

/* nothing */
"The nick of the person of did the deop'ing" = "ชื่อเล่นของคนที่ทำการ deop";

/* nothing */
"The nick of the person who has been deop'ed" = "ชื่อเล่นของคนที่ได้ทำการ deop";

/* nothing */
"The nick of the person of did the dehalfop'ing" = "ชื่อเล่นของคนที่ทำการ dehalfop";

/* nothing */
"The nick of the person who has been dehalfop'ed" = "ชื่อเล่นของคนที่ได้ทำการ dehalfop";

/* nothing */
"The nick of the person of did the devoice'ing" = "ชื่อเล่นของคนที่ทำการ devoice";

/* nothing */
"The nick of the person who has been devoice'ed" = "ชื่อเล่นของคนที่ได้ทำการ devoice";

/* nothing */
"The nick of the person of did the unban'ing" = "ชื่อเล่นของคนที่ทำการ unban";

/* nothing */
"The nick of the person who did the exempt" = "ชื่อเล่นของคนที่ทำการยกเว้น";

/* nothing */
"The exempt mask" = "มาสก์ที่ยกเว้น";

/* nothing */
"The nick of the person removed the exempt" = "ชื่อเล่นของคนที่ลบการยกเว้น";

/* nothing */
"The nick of the person who did the invite" = "ชื่อเล่นของคนที่ทำการเชิญชวน";

/* nothing */
"The invite mask" = "มาสก์เชิญชวน";

/* nothing */
"The nick of the person removed the invite" = "ชื่อเล่นของคนที่ลบการเชิญชวน";

/* nothing */
"The nick of the person setting the mode" = "ชื่อเล่นของคนที่ตั้งค่าโหมด";

/* nothing */
"The mode's sign (+/-)" = "สัญญาณของโหมด (+/-)";

/* nothing */
"The mode letter" = "ตัวอักษรของโหมด";

/* nothing */
"The channel it's being set on" = "แชนแนลที่มันกำลังตั้งค่า";

/* nothing */
"Username" = "ชื่อผู้ใช้";

/* nothing */
"Full name" = "ชื่อเต็ม";

/* nothing */
"Channel Membership/\"is an IRC operator\"" = "ความเป็นสมาชิกของแชนแนล/\"เป็นผู้จัดการ IRC คนหนึ่ง\"";

/* nothing */
"Server Information" = "ข้อมูลของเซิร์ฟเวอร์";

/* nothing */
"Idle time" = "เวลาว่าง";

/* nothing */
"Signon time" = "เวลาเข้าสู่ระบบ";

/* nothing */
"Away reason" = "เหตุผลที่ไม่อยู่";

/* nothing */
"Message" = "ข้อความ";

/* nothing */
"Account" = "บัญชี";

/* nothing */
"Real user@host" = "ชื่อผู้ใช้@โฮสต์ จริง";

/* nothing */
"Real IP" = "ไอพีจริง";

/* nothing */
"Channel Name" = "ชื่อแชนแนล";

/* nothing */
"Text" = "ข้อความ";

/* nothing */
"Server Name" = "ชื่อเซิร์ฟเวอร์";

/* nothing */
"Nick of person who invited you" = "ชื่อเล่นของคนที่เชิญชวนคุณ";

/* nothing */
"Users" = "ผู้ใช้";

/* nothing */
"Nickname in use" = "ชื่อเล่นถูกใช้อยู่";

/* nothing */
"Nick being tried" = "ชื่อเล่นกำลังถูกลองใช้";

/* nothing */
"IP" = "ไอพี";

/* nothing */
"Port" = "พอร์ต";

/* nothing */
"Network" = "เครือข่าย";

/* nothing */
"Modes string" = "สตริงแสดงโหมด";

/* nothing */
"IP address" = "ที่อยู่ไอพี";

/* nothing */
"DCC Type" = "ชนิด DCC";

/* nothing */
"Filename" = "ชื่อไฟล์";

/* nothing */
"Destination filename" = "ชื่อไฟล์ปลายทาง";

/* nothing */
"CPS" = "CPS";

/* nothing */
"Pathname" = "ชื่อเส้นทาง";

/* nothing */
"Position" = "ตำแหน่ง";

/* nothing */
"Size" = "ขนาด";

/* nothing */
"DCC String" = "ข้อความ DCC";

/* nothing */
"Number of notify items" = "หมายเลขของการแจ้งเตือนรายการ";

/* nothing */
"Old Filename" = "ชื่อไฟล์เดิม";

/* nothing */
"New Filename" = "ชื่อไฟล์ใหม่";

/* nothing */
"Receiver" = "ตัวรับ";

/* nothing */
"Hostmask" = "มาสก์ของโฮสต์";

/* nothing */
"Hostname" = "ชื่อโฮสต์";

/* nothing */
"The Packet" = "แพ็กเก็ต";

/* nothing */
"Seconds" = "วินาที";

/* nothing */
"Nick of person who have been invited" = "ชื่อของคนที่ได้ถูกเชิญ";

/* nothing */
"Banmask" = "มาสก์การแบน";

/* nothing */
"Who set the ban" = "ใครคนที่ตั้งการแบน";

/* nothing */
"Ban time" = "เวลาแบน";

/* nothing */
"Error parsing event %s.\nLoading default." = "เกิดเหตุการณ์ข้อผิดพลาดในวิเคราะห์ %s.\nโหลดค่ามาตรฐาน.";

/* nothing */
"Cannot read sound file:\n%s" = "ไม่สามารถอ่านไฟล์เสียง:\n%s";

/* nothing */
"Remote host closed socket" = "โฮสต์ปลายทางปิดแชนแนลเชื่อมต่อ";

/* nothing */
"Connection refused" = "การเชื่อมต่อถูกปฏิเสธ";

/* nothing */
"No route to host" = "ไม่มีเส้นทางไปยังโฮต์";

/* nothing */
"Connection timed out" = "การเชื่อมต่อหมดเวลา";

/* nothing */
"Cannot assign that address" = "ไม่สามารถกำหนดค่าที่อยู่นั้น";

/* nothing */
"Connection reset by peer" = "การเชื่อมต่อถูกตั้งใหม่โดยผู้เชื่อมต่อ";

/* nothing */
"Ascension Island" = "เกาะ Ascension";

/* nothing */
"Andorra" = "";

/* nothing */
"United Arab Emirates" = "สหรัฐอาหรับอิมิเรตส์";

/* nothing */
"Afghanistan" = "อัฟกานิสถาน";

/* nothing */
"Antigua and Barbuda" = "Antigua และ Barbuda";

/* nothing */
"Anguilla" = "";

/* nothing */
"Albania" = "อัลบาเนีย";

/* nothing */
"Armenia" = "อาร์เมเนีย";

/* nothing */
"Netherlands Antilles" = "";

/* nothing */
"Angola" = "";

/* nothing */
"Antarctica" = "";

/* nothing */
"Argentina" = "อาร์เจนติน่า";

/* nothing */
"Reverse DNS" = "รีเวิร์ส DNS";

/* nothing */
"American Samoa" = "";

/* nothing */
"Austria" = "ออสเตรีย";

/* nothing */
"Nato Fiel" = "";

/* nothing */
"Australia" = "ออสเตรเลีย";

/* nothing */
"Aruba" = "";

/* nothing */
"Aland Islands" = "";

/* nothing */
"Azerbaijan" = "อาร์เซอร์ไบจัน";

/* nothing */
"Bosnia and Herzegovina" = "";

/* nothing */
"Barbados" = "";

/* nothing */
"Bangladesh" = "";

/* nothing */
"Belgium" = "เบลเยี่ยม";

/* nothing */
"Burkina Faso" = "";

/* nothing */
"Bulgaria" = "บัลแกเรีย";

/* nothing */
"Bahrain" = "";

/* nothing */
"Burundi" = "";

/* nothing */
"Businesses" = "ยุ่งอยู่";

/* nothing */
"Benin" = "";

/* nothing */
"Bermuda" = "";

/* nothing */
"Brunei Darussalam" = "";

/* nothing */
"Bolivia" = "โบลิเวีย";

/* nothing */
"Brazil" = "บราซิล";

/* nothing */
"Bahamas" = "";

/* nothing */
"Bhutan" = "ภูฏาน";

/* nothing */
"Bouvet Island" = "";

/* nothing */
"Botswana" = "";

/* nothing */
"Belarus" = "";

/* nothing */
"Belize" = "";

/* nothing */
"Canada" = "แคนาดา";

/* nothing */
"Cocos Islands" = "";

/* nothing */
"Democratic Republic of Congo" = "";

/* nothing */
"Central African Republic" = "";

/* nothing */
"Congo" = "คองโก";

/* nothing */
"Switzerland" = "สวิซเซอร์แลนด์";

/* nothing */
"Cote d'Ivoire" = "";

/* nothing */
"Cook Islands" = "เกาะ Cook";

/* nothing */
"Chile" = "ชิลี";

/* nothing */
"Cameroon" = "แคมารูน";

/* nothing */
"China" = "จีน";

/* nothing */
"Colombia" = "โคลัมเบีย";

/* nothing */
"Internic Commercial" = "";

/* nothing */
"Costa Rica" = "";

/* nothing */
"Serbia and Montenegro" = "";

/* nothing */
"Cuba" = "คิวบา";

/* nothing */
"Cape Verde" = "";

/* nothing */
"Christmas Island" = "";

/* nothing */
"Cyprus" = "ไซปรัส";

/* nothing */
"Czech Republic" = "";

/* nothing */
"Germany" = "เยอรมันนี";

/* nothing */
"Djibouti" = "";

/* nothing */
"Denmark" = "เดนมาร์ก";

/* nothing */
"Dominica" = "โดมินิกา";

/* nothing */
"Dominican Republic" = "";

/* nothing */
"Algeria" = "";

/* nothing */
"Ecuador" = "";

/* nothing */
"Educational Institution" = "สถาบันการศึกษา";

/* nothing */
"Estonia" = "";

/* nothing */
"Egypt" = "อียิปต์";

/* nothing */
"Western Sahara" = "";

/* nothing */
"Eritrea" = "";

/* nothing */
"Spain" = "สเปน";

/* nothing */
"Ethiopia" = "";

/* nothing */
"European Union" = "";

/* nothing */
"Finland" = "ฟินแลนด์";

/* nothing */
"Fiji" = "ฟิจิ";

/* nothing */
"Falkland Islands" = "";

/* nothing */
"Micronesia" = "";

/* nothing */
"Faroe Islands" = "";

/* nothing */
"France" = "ฝรั่งเศส";

/* nothing */
"Gabon" = "";

/* nothing */
"Great Britain" = "";

/* nothing */
"Grenada" = "";

/* nothing */
"Georgia" = "จอร์เจีย";

/* nothing */
"French Guiana" = "";

/* nothing */
"British Channel Isles" = "";

/* nothing */
"Ghana" = "กานา";

/* nothing */
"Gibraltar" = "";

/* nothing */
"Greenland" = "กรีนแลนด์";

/* nothing */
"Gambia" = "";

/* nothing */
"Guinea" = "";

/* nothing */
"Government" = "ราชการ";

/* nothing */
"Guadeloupe" = "";

/* nothing */
"Equatorial Guinea" = "";

/* nothing */
"Greece" = "กรีซ";

/* nothing */
"S. Georgia and S. Sandwich Isles" = "";

/* nothing */
"Guatemala" = "";

/* nothing */
"Guam" = "";

/* nothing */
"Guinea-Bissau" = "";

/* nothing */
"Guyana" = "";

/* nothing */
"Hong Kong" = "ฮ่องกง";

/* nothing */
"Heard and McDonald Islands" = "";

/* nothing */
"Honduras" = "";

/* nothing */
"Croatia" = "";

/* nothing */
"Haiti" = "";

/* nothing */
"Hungary" = "";

/* nothing */
"Indonesia" = "อินโดนีเซีย";

/* nothing */
"Ireland" = "ไอร์แลนด์";

/* nothing */
"Israel" = "อิสราเอล";

/* nothing */
"Isle of Man" = "";

/* nothing */
"India" = "อินเดีย";

/* nothing */
"Informational" = "ข้อมูล";

/* nothing */
"International" = "นานาชาติ";

/* nothing */
"British Indian Ocean Territory" = "";

/* nothing */
"Iraq" = "อิรัก";

/* nothing */
"Iran" = "อิหร่าน";

/* nothing */
"Iceland" = "ไอซ์แลนด์";

/* nothing */
"Italy" = "อิตาลี";

/* nothing */
"Jersey" = "";

/* nothing */
"Jamaica" = "";

/* nothing */
"Jordan" = "จอร์แดน";

/* nothing */
"Japan" = "ญี่ปุ่น";

/* nothing */
"Kenya" = "เคนย่า";

/* nothing */
"Kyrgyzstan" = "";

/* nothing */
"Cambodia" = "กัมพูชา";

/* nothing */
"Kiribati" = "";

/* nothing */
"Comoros" = "";

/* nothing */
"St. Kitts and Nevis" = "";

/* nothing */
"North Korea" = "เกาหลีเหนือ";

/* nothing */
"South Korea" = "เกาหลีใต้";

/* nothing */
"Kuwait" = "คูเวต";

/* nothing */
"Cayman Islands" = "";

/* nothing */
"Kazakhstan" = "";

/* nothing */
"Laos" = "ลาว";

/* nothing */
"Lebanon" = "";

/* nothing */
"Saint Lucia" = "";

/* nothing */
"Liechtenstein" = "";

/* nothing */
"Sri Lanka" = "ศรีลังกา";

/* nothing */
"Liberia" = "";

/* nothing */
"Lesotho" = "";

/* nothing */
"Lithuania" = "";

/* nothing */
"Luxembourg" = "";

/* nothing */
"Latvia" = "";

/* nothing */
"Libya" = "";

/* nothing */
"Morocco" = "";

/* nothing */
"Monaco" = "โมนาโก";

/* nothing */
"Moldova" = "";

/* nothing */
"United States Medical" = "";

/* nothing */
"Madagascar" = "";

/* nothing */
"Marshall Islands" = "";

/* nothing */
"Military" = "";

/* nothing */
"Macedonia" = "";

/* nothing */
"Mali" = "มาลี";

/* nothing */
"Myanmar" = "เมียนมาร์";

/* nothing */
"Mongolia" = "มองโกเลีย";

/* nothing */
"Macau" = "";

/* nothing */
"Northern Mariana Islands" = "";

/* nothing */
"Martinique" = "";

/* nothing */
"Mauritania" = "";

/* nothing */
"Montserrat" = "";

/* nothing */
"Malta" = "";

/* nothing */
"Mauritius" = "";

/* nothing */
"Maldives" = "";

/* nothing */
"Malawi" = "";

/* nothing */
"Mexico" = "เม็กซิโก";

/* nothing */
"Malaysia" = "มาเลเซีย";

/* nothing */
"Mozambique" = "";

/* nothing */
"Namibia" = "";

/* nothing */
"New Caledonia" = "";

/* nothing */
"Niger" = "";

/* nothing */
"Internic Network" = "เครือข่าย Internic";

/* nothing */
"Norfolk Island" = "";

/* nothing */
"Nigeria" = "ไนจีเรีย";

/* nothing */
"Nicaragua" = "";

/* nothing */
"Netherlands" = "";

/* nothing */
"Norway" = "นอรเวย์";

/* nothing */
"Nepal" = "เนปาล";

/* nothing */
"Nauru" = "";

/* nothing */
"Niue" = "";

/* nothing */
"New Zealand" = "นิวซีแลนด์";

/* nothing */
"Oman" = "โอมาน";

/* nothing */
"Internic Non-Profit Organization" = "";

/* nothing */
"Panama" = "";

/* nothing */
"Peru" = "เปรู";

/* nothing */
"French Polynesia" = "";

/* nothing */
"Papua New Guinea" = "";

/* nothing */
"Philippines" = "ฟิลิปปินส์";

/* nothing */
"Pakistan" = "ปากีสถาน";

/* nothing */
"Poland" = "โปแลนด์";

/* nothing */
"St. Pierre and Miquelon" = "";

/* nothing */
"Pitcairn" = "";

/* nothing */
"Puerto Rico" = "";

/* nothing */
"Palestinian Territory" = "";

/* nothing */
"Portugal" = "";

/* nothing */
"Palau" = "";

/* nothing */
"Paraguay" = "";

/* nothing */
"Qatar" = "กาตาร์";

/* nothing */
"Reunion" = "";

/* nothing */
"Romania" = "โรมาเนีย";

/* nothing */
"Old School ARPAnet" = "โรงเรียน ARPAnet เดิม";

/* nothing */
"Russian Federation" = "";

/* nothing */
"Rwanda" = "";

/* nothing */
"Saudi Arabia" = "";

/* nothing */
"Solomon Islands" = "";

/* nothing */
"Seychelles" = "";

/* nothing */
"Sudan" = "ซูดาน";

/* nothing */
"Sweden" = "สวีเดน";

/* nothing */
"Singapore" = "สิงคโปร์";

/* nothing */
"St. Helena" = "";

/* nothing */
"Slovenia" = "";

/* nothing */
"Svalbard and Jan Mayen Islands" = "";

/* nothing */
"Slovak Republic" = "";

/* nothing */
"Sierra Leone" = "";

/* nothing */
"San Marino" = "";

/* nothing */
"Senegal" = "";

/* nothing */
"Somalia" = "";

/* nothing */
"Suriname" = "";

/* nothing */
"Sao Tome and Principe" = "";

/* nothing */
"Former USSR" = "";

/* nothing */
"El Salvador" = "";

/* nothing */
"Syria" = "";

/* nothing */
"Swaziland" = "";

/* nothing */
"Turks and Caicos Islands" = "";

/* nothing */
"Chad" = "";

/* nothing */
"French Southern Territories" = "";

/* nothing */
"Togo" = "";

/* nothing */
"Thailand" = "ไทย";

/* nothing */
"Tajikistan" = "";

/* nothing */
"Tokelau" = "";

/* nothing */
"East Timor" = "";

/* nothing */
"Turkmenistan" = "";

/* nothing */
"Tunisia" = "";

/* nothing */
"Tonga" = "";

/* nothing */
"Turkey" = "ตุรกี";

/* nothing */
"Trinidad and Tobago" = "";

/* nothing */
"Tuvalu" = "";

/* nothing */
"Taiwan" = "ไต้หวัน";

/* nothing */
"Tanzania" = "";

/* nothing */
"Ukraine" = "ยูเครน";

/* nothing */
"Uganda" = "อูกานดา";

/* nothing */
"United Kingdom" = "สหราชอาณาจักร";

/* nothing */
"United States of America" = "สหรัฐอเมริกา";

/* nothing */
"Uruguay" = "";

/* nothing */
"Uzbekistan" = "";

/* nothing */
"Vatican City State" = "";

/* nothing */
"St. Vincent and the Grenadines" = "";

/* nothing */
"Venezuela" = "";

/* nothing */
"British Virgin Islands" = "";

/* nothing */
"US Virgin Islands" = "";

/* nothing */
"Vietnam" = "เวียดนาม";

/* nothing */
"Vanuatu" = "";

/* nothing */
"Wallis and Futuna Islands" = "";

/* nothing */
"Samoa" = "";

/* nothing */
"Yemen" = "เยเมน";

/* nothing */
"Mayotte" = "";

/* nothing */
"Yugoslavia" = "";

/* nothing */
"South Africa" = "แอฟริกาใต้";

/* nothing */
"Zambia" = "";

/* nothing */
"Zimbabwe" = "";

/* nothing */
"Unknown" = "ไม่รู้จัก";

/* nothing */
"Open Dialog Window" = "เปิดหน้าต่างสนทนา";

/* nothing */
"Send a File" = "ส่งไฟล์";

/* nothing */
"User Info (WHOIS)" = "ข้อมูลผู้ใช้(WHOIS)";

/* nothing */
"Operator Actions" = "ผู้ควบคุมการปฏิบัติการ";

/* nothing */
"Give Ops" = "ให้ Ops";

/* nothing */
"Take Ops" = "รับ Ops";

/* nothing */
"Give Voice" = "ให้การประกาศ";

/* nothing */
"Take Voice" = "รับการประกาศ";

/* nothing */
"Kick/Ban" = "เตะ/แบน";

/* nothing */
"Kick" = "เตะ";

/* nothing */
"Ban" = "แบน";

/* nothing */
"KickBan" = "เตะแบน";

/* nothing */
"Direct client-to-client" = "ลูกข่ายต่อลูกข่ายโดยตรง";

/* nothing */
"Send File" = "ส่งไฟล์";

/* nothing */
"Offer Chat" = "เสนอการคุยเล่น";

/* nothing */
"Abort Chat" = "ยกเลิกการคุยเล่นก่อนเสร็จสิ้น";

/* nothing */
"Version" = "เวอร์ชั่น";

/* nothing */
"Userinfo" = "ข้อมูลผู้ใช้";

/* nothing */
"Clientinfo" = "ข้อมูลลูกข่าย";

/* nothing */
"Ping" = "Ping";

/* nothing */
"Time" = "เวลา";

/* nothing */
"Finger" = "Finger";

/* nothing */
"Oper" = "Oper";

/* nothing */
"Kill this user" = " Kill ผู้ใช้นี้";

/* nothing */
"Mode" = "โหมด";

/* nothing */
"Give Half-Ops" = "ให้ Half-Ops";

/* nothing */
"Take Half-Ops" = "รับ Half-Ops";

/* nothing */
"Ignore" = "เพิกเฉย";

/* nothing */
"Ignore User" = "เพิกเฉยต่อผู้ใช้";

/* nothing */
"UnIgnore User" = "เลิกเพิกเฉยต่อผู้ใช้";

/* nothing */
"Info" = "ข้อมูล";

/* nothing */
"Who" = "Who";

/* nothing */
"WhoIs" = "WhoIs";

/* nothing */
"DNS Lookup" = "ค้นหา DNS";

/* nothing */
"Trace" = "Trace";

/* nothing */
"UserHost" = "UserHost";

/* nothing */
"External" = "External";

/* nothing */
"Traceroute" = "Traceroute";

/* nothing */
"Telnet" = "Telnet";

/* nothing */
"Leave Channel" = "ออกจากแชนแนล";

/* nothing */
"Join Channel..." = "เข้าใช้แชนแนล...";

/* nothing */
"Enter Channel to Join:" = "ป้อนแชนแนลที่จะเข้าร่วม";

/* nothing */
"Server Links" = "การเชื่อมต่อเซิร์ฟเวอร์";

/* nothing */
"Ping Server" = "Ping เซิร์ฟเวอร์";

/* nothing */
"Hide Version" = "ซ่อนเวอร์ชั่น";

/* nothing */
"Op" = "Op";

/* nothing */
"DeOp" = "DeOp";

/* nothing */
"bye" = "ลาก่อน";

/* nothing */
"Enter reason to kick %s:" = "ป้อนเหตุผลที่จะเตะ %s:";

/* nothing */
"Sendfile" = "ส่งไฟล์";

/* nothing */
"Dialog" = "หน้าต่างสนทนา";

/* nothing */
"Send" = "ส่ง";

/* nothing */
"Chat" = "คุยเล่น";

/* nothing */
"Clear" = "ล้าง";

/* nothing */
"Couldn't connect to session bus" = "ไม่สามารถเชื่อมต่อไปยัง session bus";

/* nothing */
"Failed to complete NameHasOwner" = "ล้มเหลวในการจบ NameHasOwner";

/* nothing */
"Failed to complete Command" = "ล้มเหลวในการจบคำสั่ง";

/* nothing */
"remote access" = "เข้าถึงระยะไกล";

/* nothing */
"plugin for remote access using DBUS" = "ปล๊กอินสำหรับการเข้าถึงระยะไกลโดยใช้ DBUS";

/* nothing */
"Couldn't connect to session bus: %s\n" = "ไม่สามารถเชื่อมต่อไปยัง session bus: %s\n";

/* nothing */
"Failed to acquire %s: %s\n" = "ผิดพลาดในการร้องขอ %s: %s\n";

/* nothing */
"About XChat" = "เกี่ยวกับ XChat";

/* nothing */
"A multiplatform IRC Client" = "โปรแกรมลูกข่าย IRC หลายแพลตฟอร์ม ";

/* nothing */
"Character Chart" = "แผนผังตัวอักษร";

/* nothing */
"Not connected." = "ไม่ได้เชื่อมต่อ.";

/* nothing */
"You must select some bans." = "คุณจะต้องเลือกคนที่ถูกแบน.";

/* nothing */
"Are you sure you want to remove all bans in %s?" = "แน่ใจหรือไม่ที่ต้องการจะลบทุกคนที่ถูกแบนไว้ใน %s?";

/* nothing */
"Mask" = "มาสก์";

/* nothing */
"From" = "จาก";

/* nothing */
"Date" = "วันเวลา";

/* nothing */
"You can only open the Ban List window while in a channel tab." = "คุณสามารถเปิดหน้าต่างรายการผู้ถูกแบนเมื่ออยู่ในแท็บแชนแนลเท่านั้น.";

/* nothing */
"XChat: Ban List (%s)" = "XChat: รายการแบน (%s)";

/* nothing */
"Unban" = "เลิกแบน";

/* nothing */
"Crop" = "ตัดให้สั้น";

/* nothing */
"Refresh" = "เรียกใหม่";

/* nothing */
"Displaying %d/%d users on %d/%d channels." = "กำลังแสดง %d/%d ผู้ใช้ บน %d/%d แชนแนล.";

/* nothing */
"Select an output filename" = "เลือกชื่อไฟล์เอาต์พุท";

/* nothing */
"_Join Channel" = "เข้าแชนแนล";

/* nothing */
"_Copy Channel Name" = "คัดลอกชื่อแชนแนล";

/* nothing */
"Copy _Topic Text" = "คัดลอกข้อความหัวข้อ";

/* nothing */
"XChat: Channel List (%s)" = "XChat: รายการแชนแนล (%s)";

/* nothing */
"_Search" = "ค้น_หา";

/* nothing */
"_Download List" = "รายการ_ดาวน์โหลด";

/* nothing */
"Save _List..." = "_บันทึกรายการ...";

/* nothing */
"Show only:" = "แสดงเท่านั้น.";

/* nothing */
"channels with" = "แชนแนลกับ";

/* nothing */
"to" = "ไปยัง";

/* nothing */
"users." = "ผู้ใช้";

/* nothing */
"Look in:" = "ค้นหาใน:";

/* nothing */
"Channel name" = "ชื่อแชนแนล";

/* nothing */
"Search type:" = "ชนิดไฟล์:";

/* nothing */
"Simple Search" = "ค้นหาอย่างง่าย";

/* nothing */
"Pattern Match (Wildcards)" = "รูปแบบตรงกัน (ไวลด์การ์ด)";

/* nothing */
"Regular Expression" = "Regular Expression";

/* nothing */
"Find:" = "ค้นหา:";

/* nothing */
"Send file to %s" = "ส่งไฟล์ไปยัง %s";

/* nothing */
"That file is not resumable." = "ไฟล์นั้นไม่สามารถเริ่มต่อได้";

/* nothing */
"Cannot access file: %s\n%s.\nResuming not possible." = "ไม่สามารถเข้าถึงไฟล์: %s\n%s.\nการเชื่อมต่อไม่สามารถเป็นไปได้.";

/* nothing */
"File in download directory is larger than file offered. Resuming not possible." = "ไฟล์ในไดเร็กทอรี่ดาวน์โหลดใหญ่กว่าไฟล์ที่ถูกเสนอ. การเริ่มต่อไม่สามารถเป็นไปได้.";

/* nothing */
"Cannot resume the same file from two people." = "ไม่สามารถเริ่มต่อสำหรับไฟล์เดียวกันจากคนสองคน.";

/* nothing */
"XChat: Uploads and Downloads" = "XChat: อัพโหลดและดาวน์โหลด";

/* nothing */
"Status" = "สถานะ";

/* nothing */
"File" = "ไฟล์";

/* nothing */
"ETA" = "ETA";

/* nothing */
"Both" = "ทั้งคู่";

/* nothing */
"Uploads" = "อัพโหลด";

/* nothing */
"Downloads" = "ดาวน์โหลด";

/* nothing */
"Details" = "รายละเอียด";

/* nothing */
"File:" = "ไฟล์:";

/* nothing */
"Address:" = "ที่อยู่:";

/* nothing */
"Abort" = "ยกเลิกกลางคัน";

/* nothing */
"Accept" = "ยอมรับ";

/* nothing */
"Resume" = "เริ่มใหม่";

/* nothing */
"Open Folder..." = "เปิดโฟลเดอร์...";

/* nothing */
"XChat: DCC Chat List" = "XChat: รายการคุยเล่น DCC";

/* nothing */
"Recv" = "รับ";

/* nothing */
"Sent" = "ส่ง";

/* nothing */
"Start Time" = "เวลาเริ่ม";

/* nothing */
"*NEW*" = "*ใหม่*";

/* nothing */
"EDIT ME" = "แก้ไขฉัน";

/* nothing */
"Name" = "ชื่อ";

/* nothing */
"Command" = "คำสั่ง";

/* nothing */
"Move Up" = "เลื่อนขึ้น";

/* nothing */
"Move Dn" = "เลื่อนลง";

/* nothing */
"Cancel" = "ยกเลิก";

/* nothing */
"Save" = "บันทึก";

/* nothing */
"Add New" = "เพิ่มใหม่";

/* nothing */
"Delete" = "ลบ";

/* nothing */
"Sort" = "เรียงลำดับ";

/* nothing */
"Help" = "ช่วยเหลือ";

/* nothing */
"Don't auto connect to servers" = "ไม่เชื่อมต่อไปยังเซิร์ฟเวอร์โดยอัตโนมัติ";

/* nothing */
"Use a different config directory" = "ใช้ไดเร็กทอรี่การตั้งค่าต่างออกไป";

/* nothing */
"Don't auto load any plugins" = "ไม่โหลดปั๊กอินใด ๆ โดยอัตโนมัติ";

/* nothing */
"Show plugin auto-load directory" = "แสดงไดเร็กทอรี่ปลั๊กอินที่โหลดอัตโนมัติ";

/* nothing */
"Show user config directory" = "แสดงไดเร็กทอรี่การตั้งค่าของผู้ใช้";

/* nothing */
"Open an irc://server:port/channel URL" = "เปิด URL irc://เซิร์ฟเวอร์:พอร์ต/แชนแนล";

/* nothing */
"Open URL in an existing XChat" = "เปิด URL ใน XChat ที่มีอยู่";

/* nothing */
"Begin minimized. Level 0=Normal 1=Iconified 2=Tray" = "เริ่มต้นด้วยขนาดย่อ. ระดับ 0=ปกติ 1=เป็นไอคอน 2=ถาด";

/* nothing */
"level" = "รดับ";

/* nothing */
"Show version information" = "แสดงข้อมูลเวอร์ชั่น";

/* nothing */
"Failed to open font:\n\n%s" = "ล้มเหลวในการเปิดฟอนต์:\n\n%s";

/* nothing */
"Search buffer is empty.\n" = "การค้นหาบัฟเฟอร์ว่างเปล่า.\n";

/* nothing */
"%d bytes" = "";

/* nothing */
"Network send queue: %d bytes" = "";

/* nothing */
"The Run Command action runs the data in Data 1 as if it has been typed into the entry box where you pressed the key sequence. Thus it can contain text (which will be sent to the channel/person), commands or user commands. When run all \\n characters in Data 1 are used to deliminate seperate commands so it is possible to run more than one command. If you want a \\ in the actual text run then enter \\\\" = "ปฏิบัติการคำสั่ง Run Command  จะดำเนินการตามข้อมูลในข้อมูล1 ตามที่มันถูกพิมพ์ไปยังกล่องป้อนข้อมูลที่คุณกดคีย์เป็นอันดับคีย์. ดังนั้นมันสามารถบรรจุข้อความ (ซึ่งจะถูกส่งไปยังแชนแนล/บุคคล), คำสั่ง หรือคำสั่งของผู้ใช้. เมื่อดำเนินการ \\n ตัวอักษรในข้อมูล1 จะถูกใช้เพื่อแยกแยะคำสั่ง ดังนั้นมันเป็นไปได้ที่จะดำเนินการมากกว่าหนึ่งคำสั่ง. ถ้าคุณต้องการให้ \\ ในข้อความจริง ๆ ถูกดำเนินการแล้วป้อน \\\\";

/* nothing */
"The Change Page command switches between pages in the notebook. Set Data 1 to the page you want to switch to. If Data 2 is set to anything then the switch will be relative to the current position" = "คำสั่ง Change Page จะสลับระหว่างหน้าในสมุด. ตั้งค่าข้อมูล 1 ไปยังหน้าที่คุณต้องการสลับไป. ถ้าข้อมูล 2 ถูกตั้งค่าเป็นค่าใด ๆ แล้วตัวสวิตช์จะสัมพันธ์กับตำแหน่งปัจจุบัน";

/* nothing */
"The Insert in Buffer command will insert the contents of Data 1 into the entry where the key sequence was pressed at the current cursor position" = "คำสั่ง Insert in Buffer จะทำการเพิ่มเนื้อหาของข้อมูล 1 ไปยังตัวรับข้อมูลที่ที่ลำดับคีย์ได้ถูกกด ที่ตำแหน่งปัจจุบันของเคอร์เซอร์";

/* nothing */
"The Scroll Page command scrolls the text widget up or down one page or one line. Set Data 1 to either Up, Down, +1 or -1." = "คำสั่ง Scroll Page เลื่อนส่วนประกอบที่เป็นข้อความขึ้นหรือลงหนึงหน้าหรือหนึ่งบรรทัด. ตั้งค่าข้อมูล 1 ไปเป็นทั้ง ขึ้น, ลง, +1 หรือ -1.";

/* nothing */
"The Set Buffer command sets the entry where the key sequence was entered to the contents of Data 1" = "คำสั่ง Set Buffer ตั้งค่าตัวรับข้อมูลไปยังที่ ที่ลำดับของคีย์ที่ได้ถูกป้อนเข้ามาไปยังเนื้อหาของข้อมูล 1";

/* nothing */
"The Last Command command sets the entry to contain the last command entered - the same as pressing up in a shell" = "คำสั่ง Last Command ตั้งค่าตัวรับข้อมูลไปยังคำสั่งล่าสุดที่ถูกป้อน - เช่นเดียวกับการกดลูกศรขึ้นในเชลล์";

/* nothing */
"The Next Command command sets the entry to contain the next command entered - the same as pressing down in a shell" = "คำสั่ง Next Command ตั้งค่าตัวรับข้อมูลไปยังคำสั่งถัดไปที่ถูกป้อน - เช่นเดียวกับการกดลูกศรลงในเชลล์";

/* nothing */
"This command changes the text in the entry to finish an incomplete nickname or command. If Data 1 is set then double-tabbing in a string will select the last nick, not the next" = "คำสั่งนี้จะเปลี่ยนข้อความที่อยู่ในรายการป้อน เพื่อจะทำชื่อหรือคำสั่งที่ไม่เรียบร้อยให้สมบูรณ์. ถ้าข้อมูล 1 ถูกตั้งค่า แล้วการแท็บคู่ในสตริงจะถูกเลือกในชื่อเล่นล่าสุด, ไม่ใช่ถัดไป.";

/* nothing */
"This command scrolls up and down through the list of nicks. If Data 1 is set to anything it will scroll up, else it scrolls down" = "คำสั่งนี้จะเลื่อนขึ้นหรือลงไปยังรายการชื่อเล่น. ถ้าข้อมูล1 ถูกตั้งไปเป็นอะไรก็ตามมันจะเลื่อนขึ้น, ไม่อย่างนั้นจะเลื่อนลง";

/* nothing */
"This command checks the last word entered in the entry against the replace list and replaces it if it finds a match" = "คำสั่งนี้ตรวจสอบคำล่าสุดที่ถูกป้อนไปยังตัวป้อน แทนที่จะเป็นรายการแทนที่ และแทนที่มันถ้าค้นพบสิ่งที่ตรงกัน";

/* nothing */
"This command moves the front tab left by one" = "คำสั่งนี้ย้ายแท็บด้านหน้าไปทางซ้ายหนึ่งอันดับ";

/* nothing */
"This command moves the front tab right by one" = "คำสั่งนี้ย้ายแท็บด้านหน้าไปทางขวาหนึ่งอันดับ";

/* nothing */
"This command moves the current tab family to the left" = "คำสั่งนี้ย้ายสมาชิกแท็บปัจจุบันไปทางซ้าย";

/* nothing */
"This command moves the current tab family to the right" = "คำสั่งนี้ย้ายสมาชิกแท็บปัจจุบันไปทางขวา";

/* nothing */
"Push input line into history but doesn't send to server" = "ใส่บรรทัดการป้อนเข้าไปยังประวัติแต่ไม่ต้องส่งไปยังเซิร์ฟเวอร์";

/* nothing */
"There was an error loading key bindings configuration" = "มีปัญหาในการโหลดการตั้งค่าการผูกคีย์";

/* nothing */
"<none>" = "<none>";

/* nothing */
"Mod" = "ปรับ";

/* nothing */
"Key" = "คีย์";

/* nothing */
"Action" = "ปฏิบัติการ";

/* nothing */
"XChat: Keyboard Shortcuts" = "XChat: แป้นพิมพ์ลัด";

/* nothing */
"Shift" = "Shift";

/* nothing */
"Alt" = "Alt";

/* nothing */
"Ctrl" = "Ctrl";

/* nothing */
"Data 1" = "ข้อมูล 1";

/* nothing */
"Data 2" = "ข้อมูล 2";

/* nothing */
"Error opening keys config file\n" = "ไม่สามารถเปิดไฟล์ตั้งค่าคีย์\n";

/* nothing */
"Unknown keyname %s in key bindings config file\nLoad aborted, please fix %s/keybindings.conf\n" = "ไม่รู้จักชื่อคีย์ %s ในไฟล์ปรับแต่งการผูกคีย์\nยกเลิกการโหลดก่อนเสร็จสิ้น, กรุณาแก้ไข %s/keybindings.conf\n";

/* nothing */
"Unknown action %s in key bindings config file\nLoad aborted, Please fix %s/keybindings\n" = "ไม่รู้จักปฏิบัติการ %s ในไฟล์ปรับแต่งการผูกคีย์\nยกเลิกการโหลดก่อนเสร็จสิ้น, กรุณาแก้ไข %s/keybindings.conf\n";

/* nothing */
"Expecting Data line (beginning Dx{:|!}) but got:\n%s\n\nLoad aborted, Please fix %s/keybindings\n" = "คาดหมายบรรทัดข้อมูล (เริ่มด้วย Dx{:|!}) แต่ได้:\n%s\n\nยกเลิกการโหลดก่อนเสร็จสิ้น, กรุณาแก้ไข %s/keybindings.conf\n";

/* nothing */
"Key bindings config file is corrupt, load aborted\nPlease fix %s/keybindings.conf\n" = "ไฟล์ปรับแต่งการผูกคีย์เสียหาย, ยกเลิกการโหลดก่อนเสร็จสิ้น\nกรุณาแก้ไข %s/keybindings.conf\n";

/* nothing */
"Cannot write to that file." = "ไม่สามารถเขียนไฟล์นั้นได้";

/* nothing */
"Cannot read that file." = "ไม่สามารถอ่านไฟล์นั้นได้";

/* nothing */
"That mask already exists." = "มาสก็นั้นมีอยู่แล้ว";

/* nothing */
"Private" = "ส่วนตัว";

/* nothing */
"Notice" = "ประกาศ";

/* nothing */
"CTCP" = "CTCP";

/* nothing */
"DCC" = "DCC";

/* nothing */
"Invite" = "เชิญชวน";

/* nothing */
"Unignore" = "เลิกเพิกเฉย";

/* nothing */
"Enter mask to ignore:" = "ป้อนมาสก์เพื่อเพิกเฉย";

/* nothing */
"XChat: Ignore list" = "XChat: รายการเพิกเฉย";

/* nothing */
"Ignore Stats:" = "สถิติการเพิกเฉย:";

/* nothing */
"Channel:" = "แชนแนล:";

/* nothing */
"Private:" = "ส่วนตัว:";

/* nothing */
"Notice:" = "ประกาศ:";

/* nothing */
"CTCP:" = "CTCP:";

/* nothing */
"Invite:" = "เชิญชวน:";

/* nothing */
"Add..." = "เพิ่ม...";

/* nothing */
"Channel name too short, try again." = "ชื่อแชนแนลสั้นเกินไป, ลองใหม่อีกครั้ง.";

/* nothing */
"XChat: Connection Complete" = "XChat: การเชื่อมต่อเสร็จสมบูรณ์";

/* nothing */
"Connection to %s complete." = "การเชื่อมต่อไปยัง %s เสร็จสมบูรณ์.";

/* nothing */
"In the Server-List window, no channel (chat room) has been entered to be automatically joined for this network." = "ในหน้าต่างรายชื่อเซิร์ฟเวอร์, ไม่มีแชนแนล(แชนแนลคุยเล่น)ที่ถูกป้อนเพื่อที่จะเข้าร่วมในเครือข่ายนี้.";

/* nothing */
"What would you like to do next?" = "คุณอยากจะทำอะไรต่อไป?";

/* nothing */
"_Nothing, I'll join a channel later." = "ไม่ทำอะไรเลย. ฉันจะเข้าแชนแนลทีหลัง";

/* nothing */
"_Join this channel:" = "เ_ข้าร่วมแชนแนลนี้";

/* nothing */
"If you know the name of the channel you want to join, enter it here." = "ถ้าคุณรู้ชื่อของแชนแนลที่คุณต้องการเข้าร่วม. ป้อนมันที่นี่.";

/* nothing */
"O_pen the Channel-List window." = "เปิ_ดหน้าต่างรายชื่อแชนแนล";

/* nothing */
"Retrieving the Channel-List may take a minute or two." = "ร้องขอรายชื่อแชนแนลอาจใช้เวลาสองสามนาที.";

/* nothing */
"_Always show this dialog after connecting." = "แสดงหน้าต่างสนทนานี้หลังจากการเชื่อมต่อ_ตลอด.";

/* nothing */
"Dialog with" = "การสนทนากับ";

/* nothing */
"Topic for %s is: %s" = "หัวข้อสำหรับ %s คือ: %s";

/* nothing */
"No topic is set" = "ไม่มีหัวข้อถูกตั้ง.";

/* nothing */
"This server still has %d channels or dialogs associated with it. Close them all?" = "เซิร์ฟเวอร์นี้ยังคงมี %d แชนแนลหรือการสนทนาที่ถูกเชื่อมโยงด้วย. ต้องการปิดทั้งหมด?";

/* nothing */
"Quit XChat?" = "ออกจาก XChat?";

/* nothing */
"Don't ask next time." = "ไม่ต้องถามในครั้งหน้า.";

/* nothing */
"You are connected to %i IRC networks." = "คุณกำลังเชื่อมต่อไปยังเครือข่าย IRC %i .";

/* nothing */
"Are you sure you want to quit?" = "คุณแน่ใจแล้วหรือไม่ที่จะออก?";

/* nothing */
"Some file transfers are still active." = "การโอนย้ายไฟล์บางไฟล์ยังคงทำงานอยู่.";

/* nothing */
"_Minimize to Tray" = "_ย่อไปยังถาด";

/* nothing */
"Insert Attribute or Color Code" = "ใส่คุณลักษณะหรือรหัสสี";

/* nothing */
"<b>Bold</b>" = "<b>ตัวหนา</b>";

/* nothing */
"<u>Underline</u>" = "<u>ขีดเส้นใต้</u>";

/* nothing */
"Normal" = "ปกติ";

/* nothing */
"Colors 0-7" = "สี 0-7";

/* nothing */
"Colors 8-15" = "สี 8-15";

/* nothing */
"Beep on message" = "บี๊บเมื่อมีข้อความ";

/* nothing */
"Blink tray on message" = "กระพริบถาดเมื่อมีข้อความ";

/* nothing */
"Show join/part messages" = "แสดงข้อความเข้าร่วม/ออกจากแชนแนล";

/* nothing */
"Color paste" = "เพลตสี";

/* nothing */
"_Close Tab" = "ปิ_ดแท็บ";

/* nothing */
"_Detach Tab" = "_ถอดแท็บออก";

/* nothing */
"User limit must be a number!\n" = "ขีดจำกัดผู้ใช้ต้องเป็นตัวเลข!\n";

/* nothing */
"Topic Protection" = "การป้องกันหัวข้อ";

/* nothing */
"No outside messages" = "ไม่มีข้อความภายนอก";

/* nothing */
"Secret" = "ลับเฉพาะ";

/* nothing */
"Invite Only" = "รับเชิญเท่านั้น";

/* nothing */
"Moderated" = "ปรับปรุง";

/* nothing */
"Ban List" = "รายการแบน";

/* nothing */
"Keyword" = "คีย์เวิร์ด";

/* nothing */
"User Limit" = "ขีดจำกัดผู้ใช้";

/* nothing */
"Show/Hide userlist" = "แสดง/ซ่อนรายการผู้ใช้";

/* nothing */
"Unable to set transparent background!\n\nYou may be using a non-compliant window\nmanager that is not currently supported.\n" = "ไม่สามารถตั้งค่าความโปร่งใสของพื้นหลังได้!\n\nคุณอาจกำลังใช้ตัวจัดการหน้าต่าง\nปัจจุบันที่ไม่สนับสนุนการทำงาน\n";

/* nothing */
"Enter new nickname:" = "ป้อนชื่อเล่นใหม่:";

/* nothing */
"Host unknown" = "ไม่รู้จักโฮสต์";

/* nothing */
"<tt><b>%-11s</b></tt> %s" = "<tt><b>%-11s</b></tt> %s";

/* nothing */
"Real Name:" = "ชื่อจริง";

/* nothing */
"User:" = "ผู้ใช้:";

/* nothing */
"Country:" = "ประเทศ:";

/* nothing */
"Server:" = "เซิร์ฟเวอร์:";

/* nothing */
"Away Msg:" = "ข้อความไม่อยู่:";

/* nothing */
"%u minutes ago" = "ผ่านมาแล้ว %u นาที";

/* nothing */
"Last Msg:" = "ข้อความล่าสุด:";

/* nothing */
"The Menubar is now hidden. You can show it again by pressing F9 or right-clicking in a blank part of the main text area." = "แถบเมนูตอนนี้ได้ซ่อนอยู่. คุณสามาระแสดงมันอีกครั้งโดนการกด F9 หรือ คลิกขวา ในที่ว่างของพื้นที่ข้อความหลัก";

/* nothing */
"Open Link in Browser" = "เปิดลิงค์ในบราวเซอร์";

/* nothing */
"Copy Selected Link" = "คัดลอกลิงค์ที่เลือก";

/* nothing */
"Join Channel" = "เข้าร่วมแชนแนล";

/* nothing */
"Part Channel" = "ออกจากแชนแนล";

/* nothing */
"Cycle Channel" = "หมุนวนแชนแนล";

/* nothing */
"XChat: User menu" = "XChat: เมนูผู้ใช้";

/* nothing */
"Edit This Menu..." = "แก้ไขเมนูนี้";

/* nothing */
"Retrieve channel list..." = "เรียกข้อมูลรายการแชนแนล...";

/* nothing */
"User Commands - Special codes:\n\n%c  =  current channel\n%e  =  current network name\n%m  =  machine info\n%n  =  your nick\n%t  =  time/date\n%v  =  xchat version\n%2  =  word 2\n%3  =  word 3\n&2  =  word 2 to the end of line\n&3  =  word 3 to the end of line\n\neg:\n/cmd john hello\n\n%2 would be \"john\"\n&2 would be \"john hello\"." = "User Commands - รหัสพิเศษ:\n\n%d  =  ข้อมูล (ctcp ทั้งหมด)\n%e  =  ชื่อเครือข่ายปัจจุบัน\n%m  =  รายละเอียดเครื่อง\n%s  =  ชื่อเล่นของคนที่ส่ง ctcp\n%t  =  เวลา/วัน\n%v = เวอร์ชั่นของ xchat%2  =  คำที่ 2\n%3  =  คำที่ 3\n&2  =  คำที่ 2 ไปยังท้ายบรรทัด\n&3  =  คำที่ 3 ไปยังท้ายบรรทัด\n\nเช่น:\n/cmd john hello\n\n%2 อาจจะเป็น \"john\"\n&2 อาจจะเป็น \"john hello\".";

/* nothing */
"Userlist Buttons - Special codes:\n\n%a  =  all selected nicks\n%c  =  current channel\n%e  =  current network name\n%h  =  selected nick's hostname\n%m  =  machine info\n%n  =  your nick\n%s  =  selected nick\n%t  =  time/date\n" = "ปุ่มรายชื่อผู้ใช้ - รหัสพิเศษ:\n\n%a  =  ทุกชื่อเล่นที่เลือก\n%c  =  แชนแนลปัจจุบัน\n%e  =  ชื่อเครือข่ายปัจจุบัน\n%h  =  ชื่อโฮสต์ของชื่อเล่นที่เลือก\n%m  =  ข้อมูลเครื่อง\n%n  =  ชื่อเล่นของคุณ\n%s  =  ชื่อเล่นที่เลือก\n%t  =  เวลา/วัน\n";

/* nothing */
"Dialog Buttons - Special codes:\n\n%a  =  all selected nicks\n%c  =  current channel\n%e  =  current network name\n%h  =  selected nick's hostname\n%m  =  machine info\n%n  =  your nick\n%s  =  selected nick\n%t  =  time/date\n" = "ปุมสนทนา - รหัสพิเศษ:\n\n%a  =  ทุกชื่อเล่นที่เลือก\n%c  =  แชนแนลปัจจุบัน\n%e  =  ชื่อเครือข่ายปัจจุบัน\n%h  =  ชื่อโฮสต์ของชื่อเล่นที่เลือก\n%m  =  ข้อมูลเครื่อง\n%n  =  ชื่อเล่นของคุณ\n%s  =  ชื่อเล่นที่เลือก\n%t  =  เวลา/วัน\n";

/* nothing */
"CTCP Replies - Special codes:\n\n%d  =  data (the whole ctcp)\n%e  =  current network name\n%m  =  machine info\n%s  =  nick who sent the ctcp\n%t  =  time/date\n%2  =  word 2\n%3  =  word 3\n&2  =  word 2 to the end of line\n&3  =  word 3 to the end of line\n\n" = "การตอบรับ CTCP - รหัสพิเศษ:\n\n%d  =  ข้อมูล (ctcp ทั้งหมด)\n%e  =  ชื่อเครือข่ายปัจจุบัน\n%m  =  รายละเอียดเครื่อง\n%s  =  ชื่อเล่นของคนที่ส่ง ctcp\n%t  =  เวลา/วัน\n%2  =  คำที่ 2\n%3  =  คำที่ 3\n&2  =  คำที่ 2 ไปยังท้ายบรรทัด\n&3  =  คำที่ 3 ไปยังท้ายบรรทัด\n\n";

/* nothing */
"URL Handlers - Special codes:\n\n%s  =  the URL string\n\nPutting a ! infront of the command\nindicates it should be sent to a\nshell instead of XChat" = "ตัวจัดการ URL - รหัสพิเศษ:\n\n%s  =  สตริง URL \n\nเติม ! ด้านหน้าของคำสั่ง\nเพื่อแสดงว่ามันจะถูกส่งไปยัง\nเชลล์แทนที่จะเป็น XChat";

/* nothing */
"XChat: User Defined Commands" = "XChat: คำสั่งที่ผู้ใช้นิยามขึ้น";

/* nothing */
"XChat: Userlist Popup menu" = "XChat: เมนูป็อบอัพรายชื่อผู้ใช้";

/* nothing */
"Replace with" = "แทนที่ด้วย";

/* nothing */
"XChat: Replace" = "XChat: แทนที่";

/* nothing */
"XChat: URL Handlers" = "XChat: ตัวจัดการ URL";

/* nothing */
"XChat: Userlist buttons" = "XChat: ปุ่มรายการผู้ใช้";

/* nothing */
"XChat: Dialog buttons" = "XChat: ปุ่มสนทนา";

/* nothing */
"XChat: CTCP Replies" = "XChat: การตอบรับ CTCP";

/* nothing */
"_XChat" = "_XChat";

/* nothing */
"Network Li_st..." = "_รายการเครือข่าย";

/* nothing */
"_New" = "สร้างให_ม่";

/* nothing */
"Server Tab..." = "แท็บเซิร์ฟเวอร์...";

/* nothing */
"Channel Tab..." = "แท็บแชนแนล...";

/* nothing */
"Server Window..." = "หน้าต่างเซิร์ฟเวอร์...";

/* nothing */
"Channel Window..." = "หน้าต่างแชนแนล...";

/* nothing */
"_Load Plugin or Script..." = "โหล_ดปลั๊กอินหรือสคริป...";

/* nothing */
"_Quit" = "_ออก";

/* nothing */
"_View" = "_มุมมอง";

/* nothing */
"_Menu Bar" = "แถบเ_มนู";

/* nothing */
"_Topic Bar" = "แถ_บหัวข้อ";

/* nothing */
"_User List" = "รา_ยการผู้ใช้";

/* nothing */
"U_serlist Buttons" = "ปุ่ม_รายการผู้ใช้";

/* nothing */
"M_ode Buttons" = "ปุ่มโหม_ด";

/* nothing */
"_Channel Switcher" = "ตัว_สวิตช์แชนแนล";

/* nothing */
"_Tabs" = "แท็_บ";

/* nothing */
"T_ree" = "ต้_นไม้";

/* nothing */
"_Network Meters" = "ตัว_วัดเครือข่าย";

/* nothing */
"Off" = "ปิด";

/* nothing */
"Graph" = "กราฟ";

/* nothing */
"_Server" = "เ_ซิร์ฟเวอร์";

/* nothing */
"_Disconnect" = "_ตัดการเชื่อมต่อ";

/* nothing */
"_Reconnect" = "เชื่อมต่อให_ม่";

/* nothing */
"Marked Away" = "ตั้งเครื่องหมายว่าไม่อยู่";

/* nothing */
"_Usermenu" = "เ_มนูผู้ใช้";

/* nothing */
"S_ettings" = "ตั้_งค่า";

/* nothing */
"_Preferences" = "ปรั_บแต่ง";

/* nothing */
"Advanced" = "ขั้นสูง";

/* nothing */
"Auto Replace..." = "แทนที่อัตโนมัติ...";

/* nothing */
"CTCP Replies..." = "การตอบรับCTCP...";

/* nothing */
"Dialog Buttons..." = "ปุ่มสนทนา";

/* nothing */
"Keyboard Shortcuts..." = "แป้นพิมพ์ลัด...";

/* nothing */
"Text Events..." = "เหตุการณ์ข้อความ...";

/* nothing */
"URL Handlers..." = "ตัวจัดการURL...";

/* nothing */
"User Commands..." = "คำสั่งผู้ใช้...";

/* nothing */
"Userlist Buttons..." = "ปุ่มรายการผู้ใช้...";

/* nothing */
"Userlist Popup..." = "ป๊อปอัพรายการผู้ใช้...";

/* nothing */
"_Window" = "_หน้าต่าง";

/* nothing */
"Ban List..." = "รายการแบน...";

/* nothing */
"Channel List..." = "รายการแชนแนล...";

/* nothing */
"Character Chart..." = "แผนผังตัวอักษร...";

/* nothing */
"Direct Chat..." = "คุยเล่นโดยตรง...";

/* nothing */
"File Transfers..." = "การโอนย้ายไฟล์...";

/* nothing */
"Ignore List..." = "รายการเพิกเฉย...";

/* nothing */
"Notify List..." = "รายการแจ้งเตือน...";

/* nothing */
"Plugins and Scripts..." = "ปลั๊กอินและสคริป...";

/* nothing */
"Raw Log..." = "ข้อมูลดิบบันทึกระบบ...";

/* nothing */
"URL Grabber..." = "ตัวดักจับ URL...";

/* nothing */
"Reset Marker Line" = "ตั้งค่าเส้นสัญลักษณ์ใหม่";

/* nothing */
"C_lear Text" = "_ล้างข้อความ";

/* nothing */
"Search Text..." = "ค้นหาข้อความ...";

/* nothing */
"Save Text..." = "บันทึกข้อความ...";

/* nothing */
"_Help" = "_ช่วยเหลือ";

/* nothing */
"_Contents" = "เ_นื้อหา";

/* nothing */
"_About" = "เกี่ยว_กับ";

/* nothing */
"_Attach Window" = "_ผูกติดหน้าต่าง";

/* nothing */
"_Close Window" = "_ปิดหน้าต่าง";

/* nothing */
"User" = "ผู้ใช้";

/* nothing */
"Last Seen" = "เห็นล่าสุด";

/* nothing */
"Offline" = "ออฟไลน์";

/* nothing */
"Never" = "ไม่เลย";

/* nothing */
"%d minutes ago" = "ผ่านมา %d นาทีแล้ว";

/* nothing */
"Online" = "ออนไลน์";

/* nothing */
"Enter nickname to add:" = "ป้อนชื่อเล่นที่จะเพิ่ม:";

/* nothing */
"Notify on these networks:" = "แจ้งเตือนบนเครือข่ายนี้";

/* nothing */
"Comma separated list of networks is accepted." = "ยอมรับรายการเครือข่ายที่แยกด้วยจุลภาค.";

/* nothing */
"XChat: Notify List" = "XChat: รายการแจ้งเตือน";

/* nothing */
"Remove" = "ลบ";

/* nothing */
"Open Dialog" = "เปิดการสนทนา";

/* nothing */
"Cannot find 'notify-send' to open balloon alerts.\nPlease install libnotify." = "ไม่พบ 'notify-send' เพื่อเปิดบอลลูนแจ้งเตือน.\nกรุณาลง libnotify.";

/* nothing */
"XChat: Connected to %u networks and %u channels" = "XChat: เชื่อมต่อไปยังเครือข่าย %u และแชนแนล %u ";

/* nothing */
"_Restore" = "_คืนค่า";

/* nothing */
"_Hide" = "_ซ่อน";

/* nothing */
"_Blink on" = "เปิดการกระ_พริบ";

/* nothing */
"Channel Message" = "ข้อความของแชนแนล";

/* nothing */
"Private Message" = "ข้อความส่วนตัว";

/* nothing */
"Highlighted Message" = "ข้อความที่ถูกเน้น";

/* nothing */
"XChat: Highlighted message from: %s (%s)" = "XChat: ข้อความที่ถูกเน้นจาก: %s (%s)";

/* nothing */
"XChat: %u highlighted messages, latest from: %s (%s)" = "XChat: %u ข้อความที่ถูกเน้น, ล่าสุดจาก: %s (%s)";

/* nothing */
"XChat: New public message from: %s (%s)" = "XChat: ข้อความสาธารณะใหม่จาก: %s (%s)";

/* nothing */
"XChat: %u new public messages." = "XChat: %u ข้อความสาธารณะใหม่.";

/* nothing */
"XChat: Private message from: %s (%s)" = "XChat: ข้อความส่วนตัวจาก: %s (%s)";

/* nothing */
"XChat: %u private messages, latest from: %s (%s)" = "XChat: %u ข้อความส่วนตัว, ล่าสุดจาก: %s (%s)";

/* nothing */
"XChat: File offer from: %s (%s)" = "XChat: เสนอไฟล์จาก: %s (%s)";

/* nothing */
"XChat: %u file offers, latest from: %s (%s)" = "XChat: %u เสนอไฟล์, ล่าสุดจาก: %s (%s)";

/* nothing */
"Description" = "คำอธิบาย";

/* nothing */
"Select a Plugin or Script to load" = "เลือกปลั๊กอินหรือสคริปที่จะโหลด";

/* nothing */
"XChat: Plugins and Scripts" = "XChat: ปลั๊กอินและสคริป";

/* nothing */
"_Load..." = "โห_ลด";

/* nothing */
"_UnLoad" = "เ_ลิกโหลด";

/* nothing */
"_Close" = "_ปิด";

/* nothing */
"Save As..." = "บันทึกเป็น...";

/* nothing */
"XChat: Rawlog (%s)" = "XChat: ข้อมูลดิบของบันทึกระบบ (%s)";

/* nothing */
"Clear rawlog" = "ล้างข้อมูลดิบของบันทึกระบบ";

/* nothing */
"The window you opened this Search for doesn't exist anymore." = "หน้าต่างที่คุณเปิดการค้นหานี้ไม่ได้มีอะไรอยู่เลย.";

/* nothing */
"Search hit end, not found." = "การค้นหาถึงส่วนท้าย, ไม่พบ.";

/* nothing */
"XChat: Search" = "XChat: การค้นหา";

/* nothing */
"_Match case" = "ตัวเล็กใหญ่_ตรงกัน";

/* nothing */
"Search _backwards" = "ค้นหา_ย้อนกลับ";

/* nothing */
"_Find" = "_ค้นหา";

/* nothing */
"New Network" = "เครือข่ายใหม่";

/* nothing */
"Really remove network \"%s\" and all its servers?" = "จะลบ \"%s\" และเซิร์ฟเวอร์ทั้งหมดจริง ๆ หรือ?";

/* nothing */
"User name and Real name cannot be left blank." = "ชื่อผู้ใช้และชื่อจริงไม่สามารที่จะปล่อยว่างได้";

/* nothing */
"XChat: Edit %s" = "XChat: แก้ไข %s";

/* nothing */
"Servers for %s" = "เซิร์ฟเวอร์สำหรับ %s";

/* nothing */
"Connect to selected server only" = "เชื่อมต่อไปยังเซิร์ฟเวอร์ที่เลือกเท่านั้น";

/* nothing */
"Don't cycle through all the servers when the connection fails." = "ไม่ต้องวนไปยังทุกเซิร์ฟเวอร์เมื่อการเชื่อมต่อล้มเหลว.";

/* nothing */
"Your Details" = "รายละเอียดของคุณ";

/* nothing */
"Use global user information" = "ใช้ข้อมูลโดยรวมของผู้ใช้";

/* nothing */
"_Nick name:" = "_ชื่อเล่น:";

/* nothing */
"Second choice:" = "ตัวเลือกอันดับสอง:";

/* nothing */
"_User name:" = "_ชื่อผู้ใช้:";

/* nothing */
"Rea_l name:" = "ชื่อ_จริง:";

/* nothing */
"Connecting" = "การเชื่อมต่อ";

/* nothing */
"Auto connect to this network at startup" = "เชื่อมต่อไปยังเครือข่ายนี้อัตโนมัติเมื่อเปิดโปรแกรม";

/* nothing */
"Use a proxy server" = "ใช้เซิร์ฟเวอร์พร็อกซี่";

/* nothing */
"Use SSL for all the servers on this network" = "ใช้ SSL สำหรับทุกเซิร์ฟเวอร์บนเครือข่ายนี้";

/* nothing */
"Accept invalid SSL certificate" = "ไดั้รับหนังสือรับรอง SSL ที่ไม่ถูกต้อง";

/* nothing */
"C_hannels to join:" = "_แชนแนลที่จะเข้าร่วม:";

/* nothing */
"Channels to join, separated by commas, but not spaces!" = "แชนแนลที่จะเข้าร่วม, แยกด้วยจุลภาค, แต่ไม่ใช่ด้วยการเว้นว่าง!";

/* nothing */
"Connect command:" = "คำสั่งเชื่อมต่อ:";

/* nothing */
"Extra command to execute after connecting. If you need more than one, set this to LOAD -e <filename>, where <filename> is a text-file full of commands to execute." = "คำสั่งเพิ่มเติมที่จะเรียกให้ทำหลังจากทำการเชื่อมต่อ. ถ้าคุณต้องการมากกว่าหนึ่ง, ตั้งค่านี้  LOAD -e <ชื่อไฟล์>, เมื่อ <ชื่อไฟล์> คือไฟล์ข้อความที่เก็บคำสั่งต่าง ๆ ที่จะเรียกให้ทำงานเอาไว้";

/* nothing */
"Nickserv password:" = "รหัสผ่านเซิร์ฟเวอร์ชื่อเล่น:";

/* nothing */
"If your nickname requires a password, enter it here. Not all IRC networks support this." = "ถ้าชื่อเล่นของคุณต้องการรัสผ่าน, ป้อนมันที่นี่. ไม่ใช่ทุกเครือข่าย IRC ที่สนับสนุน.";

/* nothing */
"Server password:" = "รหัสผ่านเซิร์ฟเวอร์:";

/* nothing */
"Password for the server, if in doubt, leave blank." = "รหัสผ่านสำหรับเซิร์ฟเวอร์, ถ้าไม่เน่ใจ, ปล่อยว่างไว้.";

/* nothing */
"Character set:" = "ชุดอักขระ:";

/* nothing */
"_Edit" = "แก้ไ_ข";

/* nothing */
"XChat: Network List" = "XChat: รายการเครือข่าย";

/* nothing */
"User Information" = "รายละเอียดผู้ใช้";

/* nothing */
"Third choice:" = "ตัวเลือกอันดับสาม:";

/* nothing */
"Networks" = "เครือข่าย";

/* nothing */
"Skip network list on startup" = "ข้ามรายชื่อเครือข่ายตอนเปิดโปรแกรม";

/* nothing */
"_Edit..." = "แก้ไ_ข...";

/* nothing */
"_Sort" = "เ_รียงลำดับ";

/* nothing */
"Sorts the network list in alphabetical order. Use SHIFT-UP and SHIFT-DOWN keys to move a row." = "เรียงรายชื่อเครือข่ายตามตัวอักษร. ใช้ปุ่ม SHIFT-UP และ SHIFT-DOWN เพื่อที่จะเคลื่อนแถว.";

/* nothing */
"C_onnect" = "เ_ชื่อมต่อ";

/* nothing */
"Text Box Appearance" = "การแสดงกล่องข้อความ";

/* nothing */
"Font:" = "ฟอนต์:";

/* nothing */
"Background image:" = "รูปพื้นหลัง:";

/* nothing */
"Scrollback lines:" = "เส้นเลื่อนกลับ:";

/* nothing */
"Colored nick names" = "ใช้ชื่อเล่นเป็นสี";

/* nothing */
"Give each person on IRC a different color" = "ให้แต่ละคนบน IRC มีสีต่างกัน";

/* nothing */
"Indent nick names" = "ย่อหน้าชื่อเล่น";

/* nothing */
"Make nick names right-justified" = "ตั้งชื่อเล่นให้ชิดขวา";

/* nothing */
"Transparent background" = "ทำการโปร่งใสพื้นหลัง";

/* nothing */
"Show marker line" = "แสดงเส้นลัญลักษณ์";

/* nothing */
"Insert a red line after the last read text." = "ใส่เส้นสีแดงหลังจากข้อความล่าสุดที่อ่าน.";

/* nothing */
"Transparency Settings" = "ตั้งค่าความโปร่งใส";

/* nothing */
"Red:" = "สีแดง:";

/* nothing */
"Green:" = "สีเขียว:";

/* nothing */
"Blue:" = "สีน้ำเงิน:";

/* nothing */
"Time Stamps" = "การประทับเวลา";

/* nothing */
"Enable time stamps" = "เปิดการประทับเวลา";

/* nothing */
"Time stamp format:" = "รูปแบบการประทับเวลา";

/* nothing */
"See strftime manpage for details." = "ดู manpage ของ strftime สำหรับรายละเอียด.";

/* nothing */
"A-Z" = "A-Z";

/* nothing */
"Last-spoke order" = "อันดับการพูดคุยล่าสุด";

/* nothing */
"Input box" = "กล่องรับข้อมูล";

/* nothing */
"Use the Text box font and colors" = "ใช้กล่องแถบฟอนต์และสี";

/* nothing */
"Spell checking" = "ตรวจสอบการสะกด";

/* nothing */
"Nick Completion" = "การเติมเต็มชื่อเล่น";

/* nothing */
"Automatic nick completion (without TAB key)" = "เติมเต็มชื่อเล่นโดยอัตโนมัติ (โดยไม่มีคีย์ TAB)";

/* nothing */
"Nick completion suffix:" = "ส่วนต่อท้ายการเติมเต็มชื่อเล่น";

/* nothing */
"Nick completion sorted:" = "การลำดับการเติมเต็มชื่อเล่น";

/* nothing */
"Input Box Codes" = "รหัสกล่องรับข้อมูล";

/* nothing */
"Interpret %nnn as an ASCII value" = "แปลง %nnn เป็นค่า ASCII";

/* nothing */
"Interpret %C, %B as Color, Bold etc" = "แปลง %C, %B เป็นสี, ตัวหนา และอื่น ๆ";

/* nothing */
"A-Z, Ops first" = "A-Z, Ops ก่อน";

/* nothing */
"Z-A, Ops last" = "Z-A, Ops ทีหลัง";

/* nothing */
"Z-A" = "Z-A";

/* nothing */
"Unsorted" = "ไม่เรียง";

/* nothing */
"Left (Upper)" = "ซ้าย(ด้านบน)";

/* nothing */
"Left (Lower)" = "ซ้าย(ด้านล่าง)";

/* nothing */
"Right (Upper)" = "ขวา(ด้านบน)";

/* nothing */
"Right (Lower)" = "ขวา(ด้านล่าง)";

/* nothing */
"Top" = "บน";

/* nothing */
"Bottom" = "ล่าง";

/* nothing */
"Hidden" = "ซ่อน";

/* nothing */
"User List" = "รายชื่อผู้ใช้";

/* nothing */
"Show hostnames in user list" = "แสดงชื่อโฮสต์ในรายชื่อผู้ใช้";

/* nothing */
"User list sorted by:" = "เรียงรายชื่อผู้ใช้ด้วย:";

/* nothing */
"Show user list at:" = "แสดงรายชื่อผู้ใช้ที่:";

/* nothing */
"Away tracking" = "ติดตามการไม่อยู่";

/* nothing */
"Track the Away status of users and mark them in a different color" = "ติดตามสถานะไม่อยู่ของผู้ใช้และทำเครื่องหมายพวกเขาในสีที่แตกต่างกัน";

/* nothing */
"On channels smaller than:" = "ในแชนแนลที่เล็กกว่า:";

/* nothing */
"Action Upon Double Click" = "ปฏิบัติการเมื่อดับเบิ้ลคลิก";

/* nothing */
"Execute command:" = "กระทำคำสั่ง:";

/* nothing */
"Windows" = "หน้าต่าง";

/* nothing */
"Tabs" = "แท็บ";

/* nothing */
"Always" = "ตลอดเวลา";

/* nothing */
"Only requested tabs" = "แท็บที่ร้องขอเท่านั้น";

/* nothing */
"Channel Switcher" = "ตัวสวิตช์แชนแนล";

/* nothing */
"Open an extra tab for server messages" = "เปิดแท็บพิเศษสำหรับข้อความจากเซิร์ฟเวอร์";

/* nothing */
"Open an extra tab for server notices" = "เปิดแท็บพิเศษสำหรับการประกาศจากเซิร์ฟเวอร์";

/* nothing */
"Open a new tab when you receive a private message" = "เปิดแท็บใหม่เมื่อคุณได้รับข้อความส่วนตัว";

/* nothing */
"Sort tabs in alphabetical order" = "เรียงแท็บตามตัวอักษร";

/* nothing */
"Small tabs" = "แท็บเล็ก";

/* nothing */
"Focus new tabs:" = "ให้ความสนใจแท็บใหม่:";

/* nothing */
"Show channel switcher at:" = "แสดงตัวสวิตช์แชนแนลที่:";

/* nothing */
"Shorten tab labels to:" = "ย่อป้ายชื่อแท็บเป็น:";

/* nothing */
"letters." = "ต้วหนังสือ.";

/* nothing */
"Tabs or Windows" = "แท็บหรือหน้าต่าง";

/* nothing */
"Open channels in:" = "เปิดแชนแนลใน:";

/* nothing */
"Open dialogs in:" = "เปิดหน้าต่างสนทนาใน:";

/* nothing */
"Open utilities in:" = "เปิดส่วนอรรถประโยชน์ใน:";

/* nothing */
"Open DCC, Ignore, Notify etc, in tabs or windows?" = "เปิด DDC, การเพิกเฉย, การแจ้งเตือน อื่น ๆ, ในแท็บหรือหน้าต่าง?";

/* nothing */
"No" = "ไม่";

/* nothing */
"Yes" = "ใช่";

/* nothing */
"Browse for save folder every time" = "มองหาโฟลเดอร์ที่บันทึกทุกครั้ง";

/* nothing */
"Files and Directories" = "ไฟล์และไดเร็กทอรี่";

/* nothing */
"Auto accept file offers:" = "ยอมรับไฟล์ที่ได้รับการเสนอให้อัตโนมัติ:";

/* nothing */
"Download files to:" = "ดาวน์โหลดไฟล์ไปยัง:";

/* nothing */
"Move completed files to:" = "ย้ายไฟล์ที่เสร็จแล้วไปที่:";

/* nothing */
"Save nick name in filenames" = "บันทึกชื่อเล่นในชื่อไฟล์";

/* nothing */
"Network Settings" = "ตั้งค่าเครือข่าย";

/* nothing */
"Get my address from the IRC server" = "รับที่อยู่ของฉันจากเซิร์ฟเวอร์ IRC";

/* nothing */
"Asks the IRC server for your real address. Use this if you have a 192.168.*.* address!" = "ร้องขอเซิร์ฟเวอร์ IRC ด้วยที่อยู่จริงของคุณ. ใช้นี่ถ้าคุณมีที่อยู่เป็น 192.168.*.* !";

/* nothing */
"DCC IP address:" = "ที่อยู่ไปพีของ DDC:";

/* nothing */
"Claim you are at this address when offering files." = "อ้างถึงคุณด้วยที่อยู่นี้เมื่อทำการเสนอไฟล์.";

/* nothing */
"First DCC send port:" = "พอร์ตสำหรับส่ง DCC แรก:";

/* nothing */
"Last DCC send port:" = "พอร์ตสำหรับส่ง DCC สุดท้าย:";

/* nothing */
"!Leave ports at zero for full range." = "!ปล่อยพอร์ตไว้ที่ศูนย์สำหรับขอบเขตทั้งหมด.";

/* nothing */
"Maximum File Transfer Speeds (bytes per second)" = "ความเร็วการขนส่งไฟล์สูงสุด (ไบต์ต่อวินาที)";

/* nothing */
"One upload:" = "การอัพโหลดหนึ่งๆ:";

/* nothing */
"Maximum speed for one transfer" = "ใช้ความเร็วสูงสุดสำหรับการขนย้ายไฟล์หนึ่ง ๆ";

/* nothing */
"One download:" = "การดาวน์โหลดหนึ่งๆ:";

/* nothing */
"All uploads combined:" = "รวมการอัพโหลดทั้งหมด:";

/* nothing */
"Maximum speed for all files" = "ใช้ความเร็วสูงสุดสำหรับทุกไฟล์";

/* nothing */
"All downloads combined:" = "รวมการดาวน์โหลดทั้งหมด:";

/* nothing */
"Alerts" = "การแจ้งเตือน";

/* nothing */
"Show tray balloons on:" = "เปิดการแสดงถาดบอลลูน:";

/* nothing */
"Blink tray icon on:" = "เปิดการกระพริบถาดไอคอน:";

/* nothing */
"Blink task bar on:" = "เปิดการกระพริบแถบงาน:";

/* nothing */
"Make a beep sound on:" = "เปิดเสียงบี๊บ:";

/* nothing */
"Enable system tray icon" = "เปิดใช้ถามไอคอนของระบบ";

/* nothing */
"Highlighted Messages" = "ข้อความที่ถูกเน้น";

/* nothing */
"Highlighted messages are ones where your nickname is mentioned, but also:" = "ข้อความที่ถูกเน้นเป็นสิ่งที่ชื่อเล่นของคุณกล่าวถึง, ยิ่งกว่านั้น:";

/* nothing */
"Extra words to highlight:" = "คำพิเศษสำหรับเน้น:";

/* nothing */
"Nick names not to highlight:" = "ไม่เน้นชื่อเล่น:";

/* nothing */
"Nick names to always highlight:" = "ชื่อเล่นสำหรับเน้นเสมอ:";

/* nothing */
"Separate multiple words with commas." = "แยกคำหลาย ๆ คำด้วยจุลภาค.";

/* nothing */
"Default Messages" = "ข้อความมาตรฐาน";

/* nothing */
"Quit:" = "ออก:";

/* nothing */
"Leave channel:" = "ออกจากแชนแนล:";

/* nothing */
"Away:" = "ไม่อยู่:";

/* nothing */
"Away" = "ไม่อยู่";

/* nothing */
"Announce away messages" = "แจ้งข้อความไม่อยู่";

/* nothing */
"Announce your away messages to all channels" = "แจ้งข้อความไม่อยู่ของคุณไปยังทุกแชนแนล";

/* nothing */
"Show away once" = "แสดงสถานะไม่อยู่ครั้งเดียว";

/* nothing */
"Show identical away messages only once" = "แสดงข้อความไม่อยู่อย่างเดียวกันเพียงครั้งเดียว";

/* nothing */
"Automatically unmark away" = "เลิกทำเครื่องหมายว่าไม่อยู่โดยอัตโนมัติ";

/* nothing */
"Unmark yourself as away before sending messages" = "เลิกทำเครื่องหมายคุณเองเป็นไม่อยู่ก่อนที่จะส่งข้อความ";

/* nothing */
"Advanced Settings" = "ตั้งค่าขั้นสูง";

/* nothing */
"Auto reconnect delay:" = "เวลาหน่วงในการเชื่อมต่ออีกครั้งอัตโนมัติ:";

/* nothing */
"Display MODEs in raw form" = "แสดงโหมดในรูปแบบข้อมูลดิบ";

/* nothing */
"Whois on notify" = "Whois เมื่อมีการแจ้งเตือน";

/* nothing */
"Sends a /WHOIS when a user comes online in your notify list" = "ส่ง /WHOIS เมื่อผู้ใช้ในรายชื่อแจ้งเตือนได้ออนไลน์";

/* nothing */
"Hide join and part messages" = "ซ่อนแชนแนลเข้าร่วม/ส่วนข้อความ";

/* nothing */
"Hide channel join/part messages by default" = "ซ่อนแชนแนลเข้าร่วม/ส่วนข้อความโดยอัตโนมัติ";

/* nothing */
"Auto Open DCC Windows" = "เปิดหน้าต่าง DCC โดยอัตโนมัติ";

/* nothing */
"Send window" = "หน้าต่างส่ง";

/* nothing */
"Receive window" = "หน้าต่างรับ";

/* nothing */
"Chat window" = "หน้าต่างคุยเล่น";

/* nothing */
"Logging" = "การบันทึกของระบบ";

/* nothing */
"Enable logging of conversations" = "เปิดการบันทึกของการพูดคุย";

/* nothing */
"Log filename:" = "ชื่อไฟล์บันทึกระบบ:";

/* nothing */
"%s=Server %c=Channel %n=Network." = "%s=เซิร์ฟเวอร์ %c=แชนแนล %n=เครือข่าย.";

/* nothing */
"Insert timestamps in logs" = "ใส่กี่ประทับเวลาในบันทึกระบบ";

/* nothing */
"Log timestamp format:" = "รูปแบบประทับเวลาของบันทึกระบบ:";

/* nothing */
"(Disabled)" = "(ปิดการทำงาน)";

/* nothing */
"Wingate" = "Wingate";

/* nothing */
"Socks4" = "Socks4";

/* nothing */
"Socks5" = "Socks5";

/* nothing */
"HTTP" = "HTTP";

/* nothing */
"MS Proxy (ISA)" = "MS Proxy (ISA)";

/* nothing */
"All Connections" = "ทุกการเชื่อมต่อ";

/* nothing */
"IRC Server Only" = "เซิร์ฟเวอร์ IRC เท่านั้น";

/* nothing */
"DCC Get Only" = "DCC Get เท่านั้น";

/* nothing */
"Your Address" = "ที่อยู่ของคุณ";

/* nothing */
"Bind to:" = "ผูกติดไปเป็น:";

/* nothing */
"Only useful for computers with multiple addresses." = "มีประโยชน์กับคอมพิวเตอร์ที่มีหลายที่อยู่เท่านั้น";

/* nothing */
"Proxy Server" = "เซิร์ฟเวอร์พร็อกซี่";

/* nothing */
"Hostname:" = "ชื่อโฮต์:";

/* nothing */
"Port:" = "พอร์ต:";

/* nothing */
"Type:" = "ชนิด:";

/* nothing */
"Use proxy for:" = "ใช้พร็อกซี่สำหรับ:";

/* nothing */
"Proxy Authentication" = "การรับรองพร็อกซี่";

/* nothing */
"Use Authentication (MS Proxy, HTTP or Socks5 only)" = "ใช้การรับรอง (MS Proxy, HTTP หรือ Socks5 เท่านั้น)";

/* nothing */
"Use Authentication (HTTP or Socks5 only)" = "ใช้การรับรอง (HTTP หรือ Socks5 เท่านั้น)";

/* nothing */
"Username:" = "ชื่อผู้ใช้:";

/* nothing */
"Password:" = "รหัสผ่าน:";

/* nothing */
"Select an Image File" = "เลือกไฟล์ภาพ";

/* nothing */
"Select Download Folder" = "เลือกโฟลเดอร์ดาวน์โหลด";

/* nothing */
"Select font" = "เลือกฟอนต์";

/* nothing */
"Browse..." = "มองหา...";

/* nothing */
"Mark identified users with:" = "ทำเครื่องหมายผู้ใช้ที่สามารถระบุตัวบุคคลได้ด้วย:";

/* nothing */
"Mark not-identified users with:" = "ทำเครื่องหมายผู้ใช้ที่ไม่สามารถระบุตัวบุคคลได้ด้วย:";

/* nothing */
"Open Data Folder" = "เปิดโฟลเดอร์ข้อมูล";

/* nothing */
"Select color" = "เลือกสี";

/* nothing */
"Text Colors" = "สีข้อความ";

/* nothing */
"mIRC colors:" = "สี mIRC:";

/* nothing */
"Local colors:" = "สีท้องถิ่น:";

/* nothing */
"Foreground:" = "พื้นหน้า:";

/* nothing */
"Background:" = "พื้นหลัง:";

/* nothing */
"Marking Text" = "ข้อความที่ทำเครื่องหมาย";

/* nothing */
"Interface Colors" = "ส่วนเชื่อมต่อผู้ใช้";

/* nothing */
"New data:" = "ข้อมูลใหม่";

/* nothing */
"Marker line:" = "เส้นสัญลักษณ์:";

/* nothing */
"New message:" = "ข้อความใหม่";

/* nothing */
"Away user:" = "ผู้ใช้ที่ไม่อยู่";

/* nothing */
"Highlight:" = "การเน้น:";

/* nothing */
"Event" = "เหตุการณ์";

/* nothing */
"Sound file" = "ไฟล์เสียง";

/* nothing */
"Select a sound file" = "เลือกไฟล์เสียง";

/* nothing */
"Sound playing method:" = "วิธีการเล่นเสียง:";

/* nothing */
"External sound playing _program:" = "โปรแกรมเล่นเสียงภาย_นอก";

/* nothing */
"_External program" = "โ_ปรแกรมภายนอก";

/* nothing */
"_Automatic" = "_อัตโนมัติ";

/* nothing */
"Sound files _directory:" = "ไ_ดเร็กทอรี่ไฟล์เสียง";

/* nothing */
"Sound file:" = "ไฟล์เสียง";

/* nothing */
"_Browse..." = "มอ_งหา...";

/* nothing */
"_Play" = "เล่_น";

/* nothing */
"Interface" = "ส่วนเชื่อมต่อผู้ใช้";

/* nothing */
"Text box" = "กล่องข้อความ";

/* nothing */
"User list" = "รายการผู้ใช้";

/* nothing */
"Channel switcher" = "สวิตช์เปลี่ยนแชนแนล";

/* nothing */
"Colors" = "สี";

/* nothing */
"Chatting" = "การคุยเล่น";

/* nothing */
"General" = "ทั่วไป";

/* nothing */
"Sound" = "เสียง";

/* nothing */
"Network setup" = "ตั้งค่าเครือข่าย";

/* nothing */
"File transfers" = "การส่งไฟล์";

/* nothing */
"Categories" = "หมวดหมู่";

/* nothing */
"You cannot place the tree on the top or bottom!\nPlease change to the <b>Tabs</b> layout in the <b>View</b> menu first." = "คุณไม่สามารถวางแผนภูมิต้นไม้บนส่วนบนหรือส่วนล่าง!\nกรุณาเปลี่ยนเป็นแผนผังแบบ <b>แท็บ</b> ในเมนู <b>มุมมอง</b> เป็นอันดับแรก.";

/* nothing */
"Some settings were changed that require a restart to take full effect." = "การตั้งค่าบางอย่างที่ถูกเปลี่ยน ต้องการที่จะเริ่มใหม่เพื่อให้เป็นผล.";

/* nothing */
"*WARNING*\nAuto accepting DCC to your home directory\ncan be dangerous and is exploitable. Eg:\nSomeone could send you a .bash_profile" = "*คำเตือน*\nการรับ DCC อัตโนมัติไปยังไดเร็กทอรีบ้านของคุณ\nอาจจะอันตรายและสร้างความเสียหายได้. เช่น:\nบางคนอาจจะสามารถส่ง .bash_profile";

/* nothing */
"XChat: Preferences" = "XChat: ปรับแต่งค่า";

/* nothing */
"There was an error parsing the string" = "มีข้อผิดพลากในการวิเคราะห์สตริง";

/* nothing */
"This signal is only passed %d args, $%d is invalid" = "สัญญาณนี้ต้องส่ง %d อาร์กิวเมนต์เท่านั้น, $%d ไม่ถูกต้อง";

/* nothing */
"Print Texts File" = "พิมพ์ไฟล์ข้อความ";

/* nothing */
"Edit Events" = "แก้ไขเหตุการณ์";

/* nothing */
"$ Number" = "$ ตัวเลข";

/* nothing */
"Load From..." = "โหลดจาก...";

/* nothing */
"Test All" = "ทดสอบทั้งหมด";

/* nothing */
"URL" = "URL";

/* nothing */
"XChat: URL Grabber" = "XChat: ตัวดักจับ URL";

/* nothing */
"Clear list" = "ล้างรายการ";

/* nothing */
"Copy selected URL" = "คัดลอก URL ที่เลือก";

/* nothing */
"Copy" = "คัดลอก";

/* nothing */
"Save list to a file" = "บันทึกรายการเป็นไฟล์";

/* nothing */
"%d ops, %d total" = "%d ops, %d ทั้งหมด";

